hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals                             */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ADC (ADC)
  */

typedef struct {                                /*!< (@ 0x40000000) ADC Structure                                              */

  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) desc CR                                                    */

    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t BGREN      : 1;            /*!< [1..1] desc BGREN                                                         */
      __IOM uint32_t TSEN       : 1;            /*!< [2..2] desc TSEN                                                          */
      __IOM uint32_t CONT       : 1;            /*!< [3..3] desc CONT                                                          */
      __IOM uint32_t CLK        : 2;            /*!< [5..4] desc CLKSRC                                                        */
      __IOM uint32_t ENS        : 3;            /*!< [8..6] desc ENS                                                           */
    } CR_f;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t START;                       /*!< (@ 0x00000008) desc START                                                 */

    struct {
      __IOM uint32_t START      : 1;            /*!< [0..0] desc START                                                         */
    } START_f;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t AWDTR;                       /*!< (@ 0x00000010) desc AWDTR                                                 */

    struct {
      __IOM uint32_t VTL        : 12;           /*!< [11..0] desc VTL                                                          */
      __IM  uint32_t            : 4;
      __IOM uint32_t VTH        : 12;           /*!< [27..16] desc VTH                                                         */
    } AWDTR_f;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t TRIGGER;                     /*!< (@ 0x00000018) desc TRIGGER                                               */

    struct {
      __IOM uint32_t ATIMTRGO   : 1;            /*!< [0..0] desc ATIMTRGO                                                      */
      __IOM uint32_t ATIMTRGO2  : 1;            /*!< [1..1] desc ATIMTRGO2                                                     */
      __IOM uint32_t ATIMCC1    : 1;            /*!< [2..2] desc ATIMCC1                                                       */
      __IOM uint32_t ATIMCC2    : 1;            /*!< [3..3] desc ATIMCC2                                                       */
      __IOM uint32_t ATIMCC3    : 1;            /*!< [4..4] desc ATIMCC3                                                       */
      __IOM uint32_t ATIMCC4    : 1;            /*!< [5..5] desc ATIMCC4                                                       */
      __IOM uint32_t ATIMCC5    : 1;            /*!< [6..6] desc ATIMCC5                                                       */
      __IOM uint32_t ATIMCC6    : 1;            /*!< [7..7] desc ATIMCC6                                                       */
      __IOM uint32_t GTIM1TRGO  : 1;            /*!< [8..8] desc GTIM1TRGO                                                     */
      __IOM uint32_t GTIM1CC1   : 1;            /*!< [9..9] desc GTIM1CC1                                                      */
      __IOM uint32_t GTIM1CC2   : 1;            /*!< [10..10] desc GTIM1CC2                                                    */
      __IOM uint32_t GTIM1CC3   : 1;            /*!< [11..11] desc GTIM1CC3                                                    */
      __IOM uint32_t GTIM1CC4   : 1;            /*!< [12..12] desc GTIM1CC4                                                    */
      __IOM uint32_t BTIM1TRGO  : 1;            /*!< [13..13] desc BTIM1TRGO                                                   */
      __IOM uint32_t BTIM2TRGO  : 1;            /*!< [14..14] desc BTIM2TRGO                                                   */
      __IOM uint32_t BTIM3TRGO  : 1;            /*!< [15..15] desc BTIM3TRGO                                                   */
      __IOM uint32_t SPI1       : 1;            /*!< [16..16] desc SPI1                                                        */
      __IOM uint32_t UART1      : 1;            /*!< [17..17] desc UART1                                                       */
      __IOM uint32_t UART2      : 1;            /*!< [18..18] desc UART2                                                       */
    } TRIGGER_f;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t AWDCR;                       /*!< (@ 0x00000020) desc AWDCR                                                 */

