hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t IN0        : 1;            /*!< [0..0] desc IN0                                                           */
      __IOM uint32_t IN1        : 1;            /*!< [1..1] desc IN1                                                           */
      __IOM uint32_t IN2        : 1;            /*!< [2..2] desc IN2                                                           */
      __IOM uint32_t IN3        : 1;            /*!< [3..3] desc IN3                                                           */
      __IOM uint32_t IN4        : 1;            /*!< [4..4] desc IN4                                                           */
      __IOM uint32_t IN5        : 1;            /*!< [5..5] desc IN5                                                           */
      __IOM uint32_t IN6        : 1;            /*!< [6..6] desc IN6                                                           */
      __IOM uint32_t IN7        : 1;            /*!< [7..7] desc IN7                                                           */
      __IOM uint32_t IN8        : 1;            /*!< [8..8] desc IN8                                                           */
      __IOM uint32_t IN9        : 1;            /*!< [9..9] desc IN9                                                           */
      __IOM uint32_t IN10       : 1;            /*!< [10..10] desc IN10                                                        */
      __IOM uint32_t IN11       : 1;            /*!< [11..11] desc IN11                                                        */
      __IOM uint32_t IN12       : 1;            /*!< [12..12] desc IN12                                                        */
      __IOM uint32_t IN13       : 1;            /*!< [13..13] desc IN13                                                        */
      __IOM uint32_t IN14       : 1;            /*!< [14..14] desc IN14                                                        */
      __IOM uint32_t IN15       : 1;            /*!< [15..15] desc IN15                                                        */
    } AWDCR_f;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t SAMPLE;                      /*!< (@ 0x00000028) desc SAMPLE                                                */

    struct {
      __IOM uint32_t SQRCH0     : 4;            /*!< [3..0] desc SQRCH0                                                        */
      __IOM uint32_t SQRCH1     : 4;            /*!< [7..4] desc SQRCH1                                                        */
      __IOM uint32_t SQRCH2     : 4;            /*!< [11..8] desc SQRCH2                                                       */
      __IOM uint32_t SQRCH3     : 4;            /*!< [15..12] desc SQRCH3                                                      */
      __IOM uint32_t SQRCH4     : 4;            /*!< [19..16] desc SQRCH4                                                      */
      __IOM uint32_t SQRCH5     : 4;            /*!< [23..20] desc SQRCH5                                                      */
      __IOM uint32_t SQRCH6     : 4;            /*!< [27..24] desc SQRCH6                                                      */
      __IOM uint32_t SQRCH7     : 4;            /*!< [31..28] desc SQRCH7                                                      */
    } SAMPLE_f;
  } ;

  union {
    __IOM uint32_t SQRCFR;                      /*!< (@ 0x0000002C) desc SQRCFR                                                */

    struct {
      __IOM uint32_t SQRCH0     : 4;            /*!< [3..0] desc SQRCH0                                                        */
      __IOM uint32_t SQRCH1     : 4;            /*!< [7..4] desc SQRCH1                                                        */
      __IOM uint32_t SQRCH2     : 4;            /*!< [11..8] desc SQRCH2                                                       */
      __IOM uint32_t SQRCH3     : 4;            /*!< [15..12] desc SQRCH3                                                      */
      __IOM uint32_t SQRCH4     : 4;            /*!< [19..16] desc SQRCH4                                                      */
      __IOM uint32_t SQRCH5     : 4;            /*!< [23..20] desc SQRCH5                                                      */
      __IOM uint32_t SQRCH6     : 4;            /*!< [27..24] desc SQRCH6                                                      */
      __IOM uint32_t SQRCH7     : 4;            /*!< [31..28] desc SQRCH7                                                      */
    } SQRCFR_f;
  } ;
  __IM  uint32_t  RESERVED5[4];

  union {
    __IM  uint32_t RESULT0;                     /*!< (@ 0x00000040) desc RESULT0                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT0_f;
  } ;

  union {
    __IM  uint32_t RESULT1;                     /*!< (@ 0x00000044) desc RESULT1                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT1_f;
  } ;

  union {
    __IM  uint32_t RESULT2;                     /*!< (@ 0x00000048) desc RESULT2                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT2_f;
  } ;

  union {
    __IM  uint32_t RESULT3;                     /*!< (@ 0x0000004C) desc RESULT3                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT3_f;
  } ;

  union {
    __IM  uint32_t RESULT4;                     /*!< (@ 0x00000050) desc RESULT4                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT4_f;
  } ;

  union {
    __IM  uint32_t RESULT5;                     /*!< (@ 0x00000054) desc RESULT5                                               */

