hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT5_f;
  } ;

  union {
    __IM  uint32_t RESULT6;                     /*!< (@ 0x00000058) desc RESULT6                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT6_f;
  } ;

  union {
    __IM  uint32_t RESULT7;                     /*!< (@ 0x0000005C) desc RESULT7                                               */

    struct {
      __IM  uint32_t RESULT     : 16;           /*!< [15..0] desc RESULT                                                       */
    } RESULT7_f;
  } ;
  __IM  uint32_t  RESERVED6[5];

  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000074) desc IER                                                   */

    struct {
      __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IOM uint32_t AWDL       : 1;            /*!< [2..2] desc AWDL                                                          */
      __IOM uint32_t AWDH       : 1;            /*!< [3..3] desc AWDH                                                          */
    } IER_f;
  } ;

  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000078) desc ICR                                                   */

    struct {
      __IOM uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IOM uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IOM uint32_t AWDL       : 1;            /*!< [2..2] desc AWDL                                                          */
      __IOM uint32_t AWDH       : 1;            /*!< [3..3] desc AWDH                                                          */
    } ICR_f;
  } ;

  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000007C) desc ISR                                                   */

    struct {
      __IM  uint32_t EOC        : 1;            /*!< [0..0] desc EOC                                                           */
      __IM  uint32_t EOS        : 1;            /*!< [1..1] desc EOS                                                           */
      __IM  uint32_t AWDL       : 1;            /*!< [2..2] desc AWDL                                                          */
      __IM  uint32_t AWDH       : 1;            /*!< [3..3] desc AWDH                                                          */
    } ISR_f;
  } ;
} ADC_TypeDef;                                     /*!< Size = 128 (0x80)                                                         */



/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc ATIM (ATIM)
  */

typedef struct {                                /*!< (@ 0x40001400) ATIM Structure                                             */

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control Register1                                          */

    struct {
      __IOM uint32_t CEN        : 1;            /*!< [0..0] desc CEN                                                           */
      __IOM uint32_t UDIS       : 1;            /*!< [1..1] desc UDIS                                                          */
      __IOM uint32_t URS        : 1;            /*!< [2..2] desc URS                                                           */
      __IOM uint32_t OPM        : 1;            /*!< [3..3] desc OPM                                                           */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] desc DIR                                                           */
      __IOM uint32_t CMS        : 2;            /*!< [6..5] desc CMS                                                           */
      __IOM uint32_t ARPE       : 1;            /*!< [7..7] desc ARPE                                                          */
      __IOM uint32_t CKD        : 2;            /*!< [9..8] desc CKD                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t UIFREMAP   : 1;            /*!< [11..11] desc UIFREMAP                                                    */
    } CR1_f;
  } ;

  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control Register2                                          */

    struct {
      __IOM uint32_t CCPC       : 1;            /*!< [0..0] desc CCPC                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t CCUS       : 1;            /*!< [2..2] desc CCUS                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t MMS        : 3;            /*!< [6..4] desc MMS                                                           */
      __IOM uint32_t TI1S       : 1;            /*!< [7..7] desc TI1S                                                          */
      __IOM uint32_t OIS1       : 1;            /*!< [8..8] desc OIS1                                                          */
      __IOM uint32_t OIS1N      : 1;            /*!< [9..9] desc OIS1N                                                         */
      __IOM uint32_t OIS2       : 1;            /*!< [10..10] desc OIS2                                                        */
      __IOM uint32_t OIS2N      : 1;            /*!< [11..11] desc OIS2N                                                       */
      __IOM uint32_t OIS3       : 1;            /*!< [12..12] desc OIS3                                                        */
      __IOM uint32_t OIS3N      : 1;            /*!< [13..13] desc OIS3N                                                       */
      __IOM uint32_t OIS4       : 1;            /*!< [14..14] desc OIS4                                                        */
      __IOM uint32_t OIS4N      : 1;            /*!< [15..15] desc OIS4N                                                       */
      __IOM uint32_t OIS5       : 1;            /*!< [16..16] desc OIS5                                                        */
      __IOM uint32_t OIS5N      : 1;            /*!< [17..17] desc OIS5N                                                       */
      __IOM uint32_t OIS6       : 1;            /*!< [18..18] desc OIS6                                                        */
      __IOM uint32_t OIS6N      : 1;            /*!< [19..19] desc OIS6N                                                       */
      __IOM uint32_t MMS2       : 5;            /*!< [24..20] desc MMS2                                                        */
      __IOM uint32_t MMSH       : 2;            /*!< [26..25] desc MMSH                                                        */
    } CR2_f;
  } ;

  union {
    __IOM uint32_t SMCR;                        /*!< (@ 0x00000008) Slave Mode Control Register                                */

