hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t CC1E       : 1;            /*!< [0..0] desc CC1E                                                          */
      __IOM uint32_t CC1P       : 1;            /*!< [1..1] desc CC1P                                                          */
      __IOM uint32_t CC1NE      : 1;            /*!< [2..2] desc CC1NE                                                         */
      __IOM uint32_t CC1NP      : 1;            /*!< [3..3] desc CC1NP                                                         */
      __IOM uint32_t CC2E       : 1;            /*!< [4..4] desc CC2E                                                          */
      __IOM uint32_t CC2P       : 1;            /*!< [5..5] desc CC2P                                                          */
      __IOM uint32_t CC2NE      : 1;            /*!< [6..6] desc CC2NE                                                         */
      __IOM uint32_t CC2NP      : 1;            /*!< [7..7] desc CC2NP                                                         */
      __IOM uint32_t CC3E       : 1;            /*!< [8..8] desc CC3E                                                          */
      __IOM uint32_t CC3P       : 1;            /*!< [9..9] desc CC3P                                                          */
      __IOM uint32_t CC3NE      : 1;            /*!< [10..10] desc CC3NE                                                       */
      __IOM uint32_t CC3NP      : 1;            /*!< [11..11] desc CC3NP                                                       */
      __IOM uint32_t CC4E       : 1;            /*!< [12..12] desc CC4E                                                        */
      __IOM uint32_t CC4P       : 1;            /*!< [13..13] desc CC4P                                                        */
      __IOM uint32_t CC4NE      : 1;            /*!< [14..14] desc CC4NE                                                       */
      __IOM uint32_t CC4NP      : 1;            /*!< [15..15] desc CC4NP                                                       */
      __IOM uint32_t CC5E       : 1;            /*!< [16..16] desc CC5E                                                        */
      __IOM uint32_t CC5P       : 1;            /*!< [17..17] desc CC5P                                                        */
      __IOM uint32_t CC5NE      : 1;            /*!< [18..18] desc CC5NE                                                       */
      __IOM uint32_t CC5NP      : 1;            /*!< [19..19] desc CC5NP                                                       */
      __IOM uint32_t CC6E       : 1;            /*!< [20..20] desc CC6E                                                        */
      __IOM uint32_t CC6P       : 1;            /*!< [21..21] desc CC6P                                                        */
      __IOM uint32_t CC6NE      : 1;            /*!< [22..22] desc CC6NE                                                       */
      __IOM uint32_t CC6NP      : 1;            /*!< [23..23] desc CC6NP                                                       */
    } CCER_f;
  } ;

  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000024) Counter Register                                           */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< [31..31] desc UIFCPY                                                      */
    } CNT_f;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000028) prescaler Register                                         */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] desc PSC                                                          */
    } PSC_f;
  } ;

  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000002C) Auto reload Register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;

  union {
    __IOM uint32_t RCR;                         /*!< (@ 0x00000030) Repetition Counter Register                                */

    struct {
      __IOM uint32_t REP        : 16;           /*!< [15..0] desc REP                                                          */
    } RCR_f;
  } ;

  union {
    __IOM uint32_t CCR1;                        /*!< (@ 0x00000034) capture compare register1                                  */

    struct {
      __IOM uint32_t CCR1       : 16;           /*!< [15..0] desc CCR1                                                         */
    } CCR1_f;
  } ;

  union {
    __IOM uint32_t CCR2;                        /*!< (@ 0x00000038) capture compare register2                                  */

    struct {
      __IOM uint32_t CCR2       : 16;           /*!< [15..0] desc CCR2                                                         */
    } CCR2_f;
  } ;

  union {
    __IOM uint32_t CCR3;                        /*!< (@ 0x0000003C) capture compare register3                                  */

    struct {
      __IOM uint32_t CCR3       : 16;           /*!< [15..0] desc CCR3                                                         */
    } CCR3_f;
  } ;

  union {
    __IOM uint32_t CCR4;                        /*!< (@ 0x00000040) capture compare register4                                  */

    struct {
      __IOM uint32_t CCR4       : 16;           /*!< [15..0] desc CCR4                                                         */
    } CCR4_f;
  } ;

  union {
    __IOM uint32_t BDTR;                        /*!< (@ 0x00000044) break and dead-time register                               */

    struct {
      __IOM uint32_t DTG        : 8;            /*!< [7..0] desc DTG                                                           */
      __IOM uint32_t LOCK       : 2;            /*!< [9..8] desc LOCK                                                          */
      __IOM uint32_t OSSI       : 1;            /*!< [10..10] desc OSSI                                                        */
      __IOM uint32_t OSSR       : 1;            /*!< [11..11] desc OSSR                                                        */
      __IOM uint32_t BKE        : 1;            /*!< [12..12] desc BKE                                                         */
      __IOM uint32_t BKP        : 1;            /*!< [13..13] desc BKP                                                         */
      __IOM uint32_t AOE        : 1;            /*!< [14..14] desc AOE                                                         */
      __IOM uint32_t MOE        : 1;            /*!< [15..15] desc MOE                                                         */
      __IOM uint32_t BKF        : 4;            /*!< [19..16] desc BKF                                                         */
      __IOM uint32_t BK2F       : 4;            /*!< [23..20] desc BK2F                                                        */
      __IOM uint32_t BK2E       : 1;            /*!< [24..24] desc BK2E                                                        */
      __IOM uint32_t BK2P       : 1;            /*!< [25..25] desc BK2P                                                        */
    } BDTR_f;
  } ;

  union {
    __IOM uint32_t CCR5;                        /*!< (@ 0x00000048) capture compare register5                                  */

