hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t CCR5       : 16;           /*!< [15..0] desc CCR5                                                         */
      __IM  uint32_t            : 10;
      __IOM uint32_t GC5C1      : 1;            /*!< [26..26] desc GC5C1                                                       */
      __IOM uint32_t GC5C2      : 1;            /*!< [27..27] desc GC5C2                                                       */
      __IOM uint32_t GC5C3      : 1;            /*!< [28..28] desc GC5C3                                                       */
      __IOM uint32_t GC5C4      : 1;            /*!< [29..29] desc GC5C4                                                       */
      __IOM uint32_t GC5C5      : 1;            /*!< [30..30] desc GC5C5                                                       */
      __IOM uint32_t GC5C6      : 1;            /*!< [31..31] desc GC5C6                                                       */
    } CCR5_f;
  } ;

  union {
    __IOM uint32_t CCR6;                        /*!< (@ 0x0000004C) capture compare register6                                  */

    struct {
      __IOM uint32_t CCR6       : 16;           /*!< [15..0] desc CCR6                                                         */
      __IM  uint32_t            : 10;
      __IOM uint32_t GC6C1      : 1;            /*!< [26..26] desc GC6C1                                                       */
      __IOM uint32_t GC6C2      : 1;            /*!< [27..27] desc GC6C2                                                       */
      __IOM uint32_t GC6C3      : 1;            /*!< [28..28] desc GC6C3                                                       */
      __IOM uint32_t GC6C4      : 1;            /*!< [29..29] desc GC6C4                                                       */
      __IOM uint32_t GC6C5      : 1;            /*!< [30..30] desc GC6C5                                                       */
      __IOM uint32_t GC6C6      : 1;            /*!< [31..31] desc GC6C6                                                       */
    } CCR6_f;
  } ;

  union {
    union {
      __IOM uint32_t CCMR3CAP;                  /*!< (@ 0x00000050) capture compare mode register 3                            */

      struct {
        __IOM uint32_t CC5S     : 2;            /*!< [1..0] desc CC5S                                                          */
        __IOM uint32_t IC5PSC   : 2;            /*!< [3..2] desc IC5PSC                                                        */
        __IOM uint32_t IC5F     : 4;            /*!< [7..4] desc IC5F                                                          */
        __IOM uint32_t CC6S     : 2;            /*!< [9..8] desc CC6S                                                          */
        __IOM uint32_t IC6PSC   : 2;            /*!< [11..10] desc IC6PSC                                                      */
        __IOM uint32_t IC6F     : 4;            /*!< [15..12] desc IC6F                                                        */
      } CCMR3CAP_f;
    } ;

    union {
      __IOM uint32_t CCMR3CMP;                  /*!< (@ 0x00000050) capture compare mode register 3                            */

      struct {
        __IOM uint32_t CC5S     : 2;            /*!< [1..0] desc CC5S                                                          */
        __IOM uint32_t OC5FE    : 1;            /*!< [2..2] desc OC5FE                                                         */
        __IOM uint32_t OC5PE    : 1;            /*!< [3..3] desc OC5PE                                                         */
        __IOM uint32_t OC5M     : 3;            /*!< [6..4] desc OC5M                                                          */
        __IOM uint32_t OC5CE    : 1;            /*!< [7..7] desc OC5CE                                                         */
        __IOM uint32_t CC6S     : 2;            /*!< [9..8] desc CC6S                                                          */
        __IOM uint32_t OC6FE    : 1;            /*!< [10..10] desc OC6FE                                                       */
        __IOM uint32_t OC6PE    : 1;            /*!< [11..11] desc OC6PE                                                       */
        __IOM uint32_t OC6M     : 3;            /*!< [14..12] desc OC6M                                                        */
        __IOM uint32_t OC6CE    : 1;            /*!< [15..15] desc OC6CE                                                       */
        __IOM uint32_t OC5MH    : 1;            /*!< [16..16] desc OC5MH                                                       */
        __IM  uint32_t          : 7;
        __IOM uint32_t OC6MH    : 1;            /*!< [24..24] desc OC6MH                                                       */
      } CCMR3CMP_f;
    } ;
  };

  union {
    __IOM uint32_t DTR2;                        /*!< (@ 0x00000054) dead-time register2                                        */

    struct {
      __IOM uint32_t DTGF       : 8;            /*!< [7..0] desc DTGF                                                          */
      __IM  uint32_t            : 8;
      __IOM uint32_t DTAE       : 1;            /*!< [16..16] desc DTAE                                                        */
      __IOM uint32_t DTPE       : 1;            /*!< [17..17] desc DTPE                                                        */
    } DTR2_f;
  } ;

  union {
    __IOM uint32_t ECR;                         /*!< (@ 0x00000058) Encoder control Register                                   */

    struct {
      __IOM uint32_t IE         : 1;            /*!< [0..0] desc IE                                                            */
      __IOM uint32_t IDIR       : 2;            /*!< [2..1] desc IDIR                                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t FIDX       : 1;            /*!< [5..5] desc FIDX                                                          */
      __IOM uint32_t IPOS       : 2;            /*!< [7..6] desc IPOS                                                          */
    } ECR_f;
  } ;

  union {
    __IOM uint32_t TISEL1;                      /*!< (@ 0x0000005C) Timer Input Select Register1                               */

