hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t TI1SEL     : 4;            /*!< [3..0] desc TI1SEL                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI2SEL     : 4;            /*!< [11..8] desc TI2SEL                                                       */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI3SEL     : 4;            /*!< [19..16] desc TI3SEL                                                      */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI4SEL     : 4;            /*!< [27..24] desc TI4SEL                                                      */
    } TISEL1_f;
  } ;

  union {
    __IOM uint32_t AF1;                         /*!< (@ 0x00000060) Alternate function Register1                               */

    struct {
      __IOM uint32_t BKINE      : 1;            /*!< [0..0] desc BKINE                                                         */
      __IOM uint32_t BKVC1E     : 1;            /*!< [1..1] desc BKVC1E                                                        */
      __IOM uint32_t BKVC2E     : 1;            /*!< [2..2] desc BKVC2E                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t BKINP      : 1;            /*!< [9..9] desc BKINP                                                         */
      __IOM uint32_t BKVC1P     : 1;            /*!< [10..10] desc BKVC1P                                                      */
      __IOM uint32_t BKVC2P     : 1;            /*!< [11..11] desc BKVC2P                                                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t ETRSEL     : 4;            /*!< [17..14] desc ETRSEL                                                      */
    } AF1_f;
  } ;

  union {
    __IOM uint32_t AF2;                         /*!< (@ 0x00000064) Alternate function Register2                               */

    struct {
      __IOM uint32_t BK2INE     : 1;            /*!< [0..0] desc BK2INE                                                        */
      __IOM uint32_t BK2VC1E    : 1;            /*!< [1..1] desc BK2VC1E                                                       */
      __IOM uint32_t BK2VC2E    : 1;            /*!< [2..2] desc BK2VC2E                                                       */
      __IM  uint32_t            : 6;
      __IOM uint32_t BK2INP     : 1;            /*!< [9..9] desc BK2INP                                                        */
      __IOM uint32_t BK2VC1P    : 1;            /*!< [10..10] desc BK2VC1P                                                     */
      __IOM uint32_t BK2VC2P    : 1;            /*!< [11..11] desc BK2VC2P                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t OCRSEL     : 3;            /*!< [18..16] desc OCRSEL                                                      */
    } AF2_f;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t TISEL2;                      /*!< (@ 0x0000006C) Timer Input Select Register2                               */

    struct {
      __IOM uint32_t TI5SEL     : 4;            /*!< [3..0] desc TI5SEL                                                        */
      __IM  uint32_t            : 4;
      __IOM uint32_t TI6SEL     : 4;            /*!< [11..8] desc TI6SEL                                                       */
    } TISEL2_f;
  } ;

  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000070) Interrupt clean register                                   */

    struct {
      __IOM uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IOM uint32_t CC1IF      : 1;            /*!< [1..1] desc CC1IF                                                         */
      __IOM uint32_t CC2IF      : 1;            /*!< [2..2] desc CC2IF                                                         */
      __IOM uint32_t CC3IF      : 1;            /*!< [3..3] desc CC3IF                                                         */
      __IOM uint32_t CC4IF      : 1;            /*!< [4..4] desc CC4IF                                                         */
      __IOM uint32_t COMIF      : 1;            /*!< [5..5] desc COMIF                                                         */
      __IOM uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
      __IOM uint32_t BIF        : 1;            /*!< [7..7] desc BIF                                                           */
      __IOM uint32_t B2IF       : 1;            /*!< [8..8] desc B2IF                                                          */
      __IOM uint32_t CC1OF      : 1;            /*!< [9..9] desc CC1OF                                                         */
      __IOM uint32_t CC2OF      : 1;            /*!< [10..10] desc CC2OF                                                       */
      __IOM uint32_t CC3OF      : 1;            /*!< [11..11] desc CC3OF                                                       */
      __IOM uint32_t CC4OF      : 1;            /*!< [12..12] desc CC4OF                                                       */
      __IOM uint32_t SBIF       : 1;            /*!< [13..13] desc SBIF                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t CC5IF      : 1;            /*!< [16..16] desc CC5IF                                                       */
      __IOM uint32_t CC6IF      : 1;            /*!< [17..17] desc CC6IF                                                       */
      __IOM uint32_t CC5OF      : 1;            /*!< [18..18] desc CC5OF                                                       */
      __IOM uint32_t CC6OF      : 1;            /*!< [19..19] desc CC6OF                                                       */
      __IOM uint32_t IDXF       : 1;            /*!< [20..20] desc IDXF                                                        */
      __IOM uint32_t DIRF       : 1;            /*!< [21..21] desc DIRF                                                        */
      __IOM uint32_t IERRF      : 1;            /*!< [22..22] desc IERRF                                                       */
      __IOM uint32_t TERRF      : 1;            /*!< [23..23] desc TERRF                                                       */
    } ICR_f;
  } ;
} ATIM_TypeDef;                                    /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                           BTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Base Timer 1 (BTIM1)
  */

typedef struct {                                /*!< (@ 0x40004800) BTIM1 Structure                                            */

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */

