hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t UDIS       : 1;            /*!< [1..1] desc UDIS                                                          */
      __IOM uint32_t URS        : 1;            /*!< [2..2] desc URS                                                           */
      __IOM uint32_t ONESHOT    : 1;            /*!< [3..3] desc ONESHOT                                                       */
      __IM  uint32_t            : 7;
      __IOM uint32_t UIFREMAP   : 1;            /*!< [11..11] desc REMAP                                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t TOGEN      : 1;            /*!< [15..15] desc TOGEN                                                       */
    } CR1_f;
  } ;

  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */

    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t MMS        : 3;            /*!< [6..4] desc MMS                                                           */
    } CR2_f;
  } ;

  union {
    __IOM uint32_t SMCR;                        /*!< (@ 0x00000008) Slave Mode Control register                                */

    struct {
      __IOM uint32_t SMS        : 3;            /*!< [2..0] desc SMS                                                           */
      __IOM uint32_t RSTISRC    : 4;            /*!< [6..3] desc RSTISRC                                                       */
      __IOM uint32_t TRGISRC    : 4;            /*!< [10..7] desc TRGISRC                                                      */
      __IOM uint32_t MSM        : 1;            /*!< [11..11] desc MSM                                                         */
      __IOM uint32_t TRGIFLT    : 3;            /*!< [14..12] desc TRGIFLT                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t RSTIPOL    : 1;            /*!< [16..16] desc RSTIPOL                                                     */
      __IOM uint32_t TRGIPOL    : 1;            /*!< [17..17] desc TRGIPOL                                                     */
    } SMCR_f;
  } ;

  union {
    __IOM uint32_t IER;                        /*!< (@ 0x0000000C) Interrupt enable register                                   */

    struct {
      __IOM uint32_t UIE        : 1;            /*!< [0..0] desc UIE                                                           */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIE        : 1;            /*!< [6..6] desc TIE                                                           */
    } IER_f;
  } ;

  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000010) Interrupt status register                                  */

    struct {
      __IM  uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IM  uint32_t            : 5;
      __IM  uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
    } ISR_f;
  } ;

  union {
    __OM  uint32_t EGR;                         /*!< (@ 0x00000014) Event Generate register                                    */

    struct {
      __OM  uint32_t UG         : 1;            /*!< [0..0] desc UG                                                            */
      __IM  uint32_t            : 5;
      __OM  uint32_t TG         : 1;            /*!< [6..6] desc TG                                                            */
    } EGR_f;
  } ;

  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000018) Interrupt flag clear register                              */

    struct {
      __IOM uint32_t UIF        : 1;            /*!< [0..0] desc UIF                                                           */
      __IM  uint32_t            : 5;
      __IOM uint32_t TIF        : 1;            /*!< [6..6] desc TIF                                                           */
    } ICR_f;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t CNT;                         /*!< (@ 0x00000024) Counter Register                                           */

    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
      __IM  uint32_t            : 15;
      __IM  uint32_t UIFCPY     : 1;            /*!< [31..31] desc UIFCPY                                                      */
    } CNT_f;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000028) Prescaler Control Register                                 */

    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] desc PSC                                                          */
    } PSC_f;
  } ;

  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x0000002C) Auto Reload Register                                       */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;
} BTIM_TypeDef;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc CRC (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */

  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) Control register                                           */

