hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
typedef struct {                                /*!< (@ 0x40005400) I2C1 Structure                                             */

  union {
    __IOM uint32_t BRREN;                       /*!< (@ 0x00000000) desc BRREN                                                 */

    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
    } BRREN_f;
  } ;

  union {
    __IOM uint32_t BRR;                         /*!< (@ 0x00000004) desc BRR                                                   */

    struct {
      __IOM uint32_t BRR        : 8;            /*!< [7..0] desc BRR                                                           */
    } BRR_f;
  } ;

  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000008) Control register                                           */

    struct {
      __IOM uint32_t FLT        : 1;            /*!< [0..0] desc FLT                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t AA         : 1;            /*!< [2..2] desc AA                                                            */
      __IOM uint32_t SI         : 1;            /*!< [3..3] desc SI                                                            */
      __IOM uint32_t STO        : 1;            /*!< [4..4] desc STO                                                           */
      __IOM uint32_t STA        : 1;            /*!< [5..5] desc STA                                                           */
      __IOM uint32_t EN         : 1;            /*!< [6..6] desc EN                                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t SCLINSRC   : 3;            /*!< [10..8] desc SCLINSRC                                                     */
      __IOM uint32_t SDAINSRC   : 3;            /*!< [13..11] desc SDAINSRC                                                    */
    } CR_f;
  } ;

  union {
    __IOM uint32_t DR;                          /*!< (@ 0x0000000C) Data register                                              */

    struct {
      __IOM uint32_t DR         : 8;            /*!< [7..0] desc DR                                                            */
    } DR_f;
  } ;

  union {
    __IOM uint32_t ADDR0;                       /*!< (@ 0x00000010) Slave Addrress0                                            */

    struct {
      __IOM uint32_t GC         : 1;            /*!< [0..0] desc GC                                                            */
      __IOM uint32_t ADDR0      : 7;            /*!< [7..1] desc ADDR0                                                         */
    } ADDR0_f;
  } ;

  union {
    __IM  uint32_t STAT;                        /*!< (@ 0x00000014) Status register                                            */

    struct {
      __IM  uint32_t STAT       : 8;            /*!< [7..0] desc STAT                                                          */
    } STAT_f;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t ADDR1;                       /*!< (@ 0x00000020) Slave Addrress1                                            */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t ADDR1      : 7;            /*!< [7..1] desc ADDR1                                                         */
    } ADDR1_f;
  } ;

  union {
    __IOM uint32_t ADDR2;                       /*!< (@ 0x00000024) Slave Addrress2                                            */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t ADDR2      : 7;            /*!< [7..1] desc ADDR2                                                         */
    } ADDR2_f;
  } ;

  union {
    __IM  uint32_t MATCH;                       /*!< (@ 0x00000028) Slave Addrress match flag                                  */

    struct {
      __IM  uint32_t ADDR0      : 1;            /*!< [0..0] desc ADDR0                                                         */
      __IM  uint32_t ADDR1      : 1;            /*!< [1..1] desc ADDR1                                                         */
      __IM  uint32_t ADDR2      : 1;            /*!< [2..2] desc ADDR2                                                         */
    } MATCH_f;
  } ;
} I2C_TypeDef;                                     /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           IRMOD                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc IRMOD (IRMOD)
  */

typedef struct {                                /*!< (@ 0x40004080) IRMOD Structure                                            */
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000008) Input selection register                                   */

    struct {
      __IOM uint32_t MOD        : 4;            /*!< [3..0] desc MOD                                                           */
      __IOM uint32_t IRSW       : 1;            /*!< [4..4] desc IRSW                                                          */
      __IOM uint32_t INV        : 1;            /*!< [5..5] desc INV                                                           */
    } CR_f;
  } ;
} IRMOD_TypeDef;                                   /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc IWDT (IWDT)
  */

typedef struct {                                /*!< (@ 0x40005000) IWDT Structure                                             */

  union {
    __OM  uint32_t KR;                          /*!< (@ 0x00000000) Key register                                               */

