hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t CKSEL      : 1;            /*!< [0..0] desc CKSEL                                                         */
      __IOM uint32_t ENCMD_CKPOL : 2;           /*!< [2..1] desc ENCMD_CKPOL                                                   */
      __IOM uint32_t CHFLT      : 2;            /*!< [4..3] desc CHFLT                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGFLT    : 2;            /*!< [7..6] desc TRIGFLT                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t PRS        : 3;            /*!< [11..9] desc PRS                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGSEL    : 3;            /*!< [15..13] desc TRIGSEL                                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t TRIGEN     : 2;            /*!< [18..17] desc TRIGEN                                                      */
      __IOM uint32_t TIMOUT     : 1;            /*!< [19..19] desc TIMOUT                                                      */
      __IOM uint32_t WAVE       : 1;            /*!< [20..20] desc WAVE                                                        */
      __IOM uint32_t WAVPOL     : 1;            /*!< [21..21] desc WAVPOL                                                      */
      __IOM uint32_t PRELOAD    : 1;            /*!< [22..22] desc PRELOAD                                                     */
      __IOM uint32_t COUNTMD    : 1;            /*!< [23..23] desc COUNTMD                                                     */
      __IOM uint32_t ENC        : 1;            /*!< [24..24] desc ENC                                                         */
      __IOM uint32_t ICLKSRC    : 2;            /*!< [26..25] desc ICLKSRC                                                     */
    } CFGR_f;
  } ;

  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000010) desc CR                                                    */

    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t SNGSTART   : 1;            /*!< [1..1] desc SNGSTART                                                      */
      __IOM uint32_t CNTSTART   : 1;            /*!< [2..2] desc CNTSTART                                                      */
      __IOM uint32_t SRST       : 1;            /*!< [3..3] desc SRST                                                          */
      __IOM uint32_t ARST       : 1;            /*!< [4..4] desc ARST                                                          */
    } CR_f;
  } ;

  union {
    __IOM uint32_t CMP;                         /*!< (@ 0x00000014) desc CMP                                                   */

    struct {
      __IOM uint32_t CMP        : 16;           /*!< [15..0] desc CMP                                                          */
    } CMP_f;
  } ;

  union {
    __IOM uint32_t ARR;                         /*!< (@ 0x00000018) desc ARR                                                   */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } ARR_f;
  } ;

  union {
    __IM  uint32_t CNT;                         /*!< (@ 0x0000001C) desc CNT                                                   */

    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
    } CNT_f;
  } ;
} LPTIM_TypeDef;                                   /*!< Size = 32 (0x20)                                                          */

/* =========================================================================================================================== */
/* ================                                           RAM                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief desc RAM (RAM)
  */

typedef struct {                                /*!< (@ 0x40022400) RAM Structure                                              */

  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000000) desc IER                                                   */

    struct {
      __IOM  uint32_t PARITY :         1;       /*!< [0..0] desc EN                                                            */
    } IER_f;
  };
  
  __IM  uint32_t ADDR;                          /*!< (@ 0x00000004) desc ADDR                                                  */  

  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000008) desc ISR                                                   */

    struct {
      __IM  uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */      
    } ISR_f;
  };

  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x0000000C) desc ICR                                                   */

    struct {
      __IOM uint32_t PARITY     : 1;            /*!< [0..0] desc PARITY                                                        */
    } ICR_f;
  };
} RAM_TypeDef;                                  /*!< Size = 16 (0x10)                                                          */


/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x40000C00) UART1 Structure                                            */

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */

