hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IM  uint32_t TIMCNT     : 24;           /*!< [23..0] desc TIMARR                                                       */
    } TIMCNT_f;
  } ;

  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x0000001C) Interrupt status register                                  */

    struct {
      __IM  uint32_t TXE        : 1;            /*!< [0..0] desc TXE                                                           */
      __IM  uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IM  uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IM  uint32_t RXIDLE     : 1;            /*!< [3..3] desc RXIDLE                                                        */
      __IM  uint32_t RXBRK      : 1;            /*!< [4..4] desc RXBRK                                                         */
      __IM  uint32_t BAUD       : 1;            /*!< [5..5] desc BAUD                                                          */
      __IM  uint32_t TIMOV      : 1;            /*!< [6..6] desc TIMOV                                                         */
      __IM  uint32_t CTS        : 1;            /*!< [7..7] desc CTS                                                           */
      __IM  uint32_t FE         : 1;            /*!< [8..8] desc FE                                                            */
      __IM  uint32_t PE         : 1;            /*!< [9..9] desc PE                                                            */
      __IM  uint32_t NE         : 1;            /*!< [10..10] desc NE                                                          */
      __IM  uint32_t ORE        : 1;            /*!< [11..11] desc ORE                                                         */
      __IM  uint32_t RXMATCH    : 1;            /*!< [12..12] desc RXMATCH                                                     */
      __IM  uint32_t SLVMATCH   : 1;            /*!< [13..13] desc SLVMATCH                                                    */
      __IM  uint32_t TXBUSY     : 1;            /*!< [14..14] desc TXBUSY                                                      */
      __IM  uint32_t CTSLV      : 1;            /*!< [15..15] desc CTSLV                                                       */
    } ISR_f;
  } ;

  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000020) Interrupt flag clear register                              */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t TC         : 1;            /*!< [1..1] desc TC                                                            */
      __IOM uint32_t RC         : 1;            /*!< [2..2] desc RC                                                            */
      __IOM uint32_t RXIDLE     : 1;            /*!< [3..3] desc RXIDLE                                                        */
      __IOM uint32_t RXBRK      : 1;            /*!< [4..4] desc RXBRK                                                         */
      __IOM uint32_t BAUD       : 1;            /*!< [5..5] desc BAUD                                                          */
      __IOM uint32_t TIMOV      : 1;            /*!< [6..6] desc TIMOV                                                         */
      __IOM uint32_t CTS        : 1;            /*!< [7..7] desc CTS                                                           */
      __IOM uint32_t FE         : 1;            /*!< [8..8] desc FE                                                            */
      __IOM uint32_t PE         : 1;            /*!< [9..9] desc PE                                                            */
      __IOM uint32_t NE         : 1;            /*!< [10..10] desc NE                                                          */
      __IOM uint32_t ORE        : 1;            /*!< [11..11] desc ORE                                                         */
      __IOM uint32_t RXMATCH    : 1;            /*!< [12..12] desc RXMATCH                                                     */
    } ICR_f;
  } ;

  union {
    __IM  uint32_t RDR;                         /*!< (@ 0x00000024) Data reg for read                                          */

    struct {
      __IM  uint32_t RDR        : 9;            /*!< [8..0] desc RDR                                                           */
    } RDR_f;
  } ;

  union {
    __OM  uint32_t TDR;                         /*!< (@ 0x00000028) Data reg for write                                         */

    struct {
      __OM  uint32_t TDR        : 9;            /*!< [8..0] desc TDR                                                           */
      __OM  uint32_t IDLE       : 1;            /*!< [9..9] desc IDLE                                                          */
      __OM  uint32_t BREAK      : 1;            /*!< [10..10] desc BREAK                                                       */
    } TDR_f;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t ADDR;                        /*!< (@ 0x00000030) Slave addr                                                 */

    struct {
      __IOM uint32_t ADDR       : 8;            /*!< [7..0] desc ADDR                                                          */
    } ADDR_f;
  } ;

  union {
    __IOM uint32_t MASK;                        /*!< (@ 0x00000034) Slave addr mask                                            */

    struct {
      __IOM uint32_t MASK       : 8;            /*!< [7..0] desc MASK                                                          */
    } MASK_f;
  } ;

  union {
    __IOM uint32_t CR3;                         /*!< (@ 0x00000038) Control register3                                          */

    struct {
      __IOM uint32_t DEM        : 1;            /*!< [0..0] desc DEM                                                           */
      __IOM uint32_t DEP        : 1;            /*!< [1..1] desc DEP                                                           */
      __IOM uint32_t DETIME     : 5;            /*!< [6..2] desc DETIME                                                        */
      __IOM uint32_t LIN        : 1;            /*!< [7..7] desc LIN                                                           */
      __IOM uint32_t BRKL       : 1;            /*!< [8..8] desc LINBRK                                                        */
    } CR3_f;
  } ;

  union {
    __IOM uint32_t RXMATCH;                     /*!< (@ 0x0000003C) desc RXMATCH                                               */

