hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t RXMATCH    : 9;            /*!< [8..0] desc RXMATCH                                                       */
    } RXMATCH_f;
  } ;
} UART_TypeDef;                                    /*!< Size = 64 (0x40)                                                          */



/* =========================================================================================================================== */
/* ================                                            LVD                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc LVD (LVD)
  */

typedef struct {                                /*!< (@ 0x400000D0) LVD Structure                                              */

  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) Control register0                                          */

    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t ACTION     : 1;            /*!< [1..1] desc ACTION                                                        */
      __IOM uint32_t SOURCE     : 1;            /*!< [2..2] desc SOURCE                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t VTH        : 3;            /*!< [6..4] desc VTH                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLTCLK     : 1;            /*!< [8..8] desc FLTCLK                                                        */
    } CR0_f;
  } ;

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) Control register1                                          */

    struct {
      __IOM uint32_t IE         : 1;            /*!< [0..0] desc IE                                                            */
      __IOM uint32_t LEVEL      : 1;            /*!< [1..1] desc LEVEL                                                         */
      __IOM uint32_t FALL       : 1;            /*!< [2..2] desc FALL                                                          */
      __IOM uint32_t RISE       : 1;            /*!< [3..3] desc RISE                                                          */
      __IOM uint32_t FLTTIME    : 4;            /*!< [7..4] desc FLTTIME                                                       */
    } CR1_f;
  } ;

  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) status register                                            */

    struct {
      __IOM uint32_t INTF       : 1;            /*!< [0..0] desc INTF                                                          */
      __IM  uint32_t FLTV       : 1;            /*!< [1..1] desc FLTV                                                          */
    } SR_f;
  } ;
} LVD_TypeDef;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc RTC (RTC)
  */

typedef struct {                                /*!< (@ 0x40004400) RTC Structure                                              */

  union {
    __OM  uint32_t KEY;                         /*!< (@ 0x00000000) desc KEY                                                   */

    struct {
      __OM  uint32_t KEY        : 8;            /*!< [7..0] desc KEY                                                           */
    } KEY_f;
  } ;

  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000004) desc CR0                                                   */

    struct {
      __IOM uint32_t INTERVAL   : 3;            /*!< [2..0] desc INTERVAL                                                      */
      __IOM uint32_t H24        : 1;            /*!< [3..3] desc H24                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC1HZ     : 2;            /*!< [6..5] desc RTC1HZ                                                        */
      __IOM uint32_t START      : 1;            /*!< [7..7] desc START                                                         */
    } CR0_f;
  } ;

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000008) desc CR1                                                   */

    struct {
      __IOM uint32_t ACCESS     : 1;            /*!< [0..0] desc ACCESS                                                        */
      __IM  uint32_t WINDOW     : 1;            /*!< [1..1] desc WINDOW                                                        */
      __IM  uint32_t WAIT       : 1;            /*!< [2..2] desc WAIT                                                          */
      __IM  uint32_t            : 5;
      __IOM uint32_t SOURCE     : 3;            /*!< [10..8] desc SOURCE                                                       */
    } CR1_f;
  } ;

  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x0000000C) desc CR2                                                   */

    struct {
      __IOM uint32_t AWTPRS     : 2;            /*!< [1..0] desc AWTPRS                                                        */
      __IOM uint32_t AWTSRC     : 1;            /*!< [2..2] desc AWTSRC                                                        */
      __IOM uint32_t TAMPEDGE   : 1;            /*!< [3..3] desc TAMPEDGE                                                      */
      __IOM uint32_t RTCOUT     : 2;            /*!< [5..4] desc RTCOUT                                                        */
      __IOM uint32_t TAMPEN     : 1;            /*!< [6..6] desc TAMPEN                                                        */
      __IOM uint32_t AWTEN      : 1;            /*!< [7..7] desc AWTEN                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t ALARMAEN   : 1;            /*!< [9..9] desc ALARMAEN                                                      */
      __IOM uint32_t ALARMBEN   : 1;            /*!< [10..10] desc ALARMBEN                                                    */
    } CR2_f;
  } ;

  union {
    __IOM uint32_t COMPCFR1;                    /*!< (@ 0x00000010) desc COMPCFR1                                              */

