hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t COMP       : 12;           /*!< [11..0] desc COMP                                                         */
      __IOM uint32_t PERIOD     : 2;            /*!< [13..12] desc PERIOD                                                      */
      __IOM uint32_t SIGN       : 1;            /*!< [14..14] desc SIGN                                                        */
      __IOM uint32_t EN         : 1;            /*!< [15..15] desc EN                                                          */
    } COMPCFR1_f;
  } ;

  union {
    __IOM uint32_t DATE;                        /*!< (@ 0x00000014) desc DATE                                                  */

    struct {
      __IOM uint32_t DAY        : 8;            /*!< [7..0] desc DAY                                                           */
      __IOM uint32_t MONTH      : 8;            /*!< [15..8] desc MONTH                                                        */
      __IOM uint32_t YEAR       : 8;            /*!< [23..16] desc YEAR                                                        */
      __IOM uint32_t WEEK       : 3;            /*!< [26..24] desc WEEK                                                        */
    } DATE_f;
  } ;

  union {
    __IOM uint32_t TIME;                        /*!< (@ 0x00000018) desc TIME                                                  */

    struct {
      __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
    } TIME_f;
  } ;

  union {
    __IOM uint32_t ALARMA;                      /*!< (@ 0x0000001C) desc ALARMA                                                */

    struct {
      __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
      __IOM uint32_t SECONDEN   : 1;            /*!< [7..7] desc SECONDEN                                                      */
      __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
      __IOM uint32_t MINUTEEN   : 1;            /*!< [15..15] desc MINUTEEN                                                    */
      __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t HOUREN     : 1;            /*!< [23..23] desc HOUREN                                                      */
      __IOM uint32_t WEEKMASK   : 7;            /*!< [30..24] desc WEEKMASK                                                    */
    } ALARMA_f;
  } ;

  union {
    __IOM uint32_t ALARMB;                      /*!< (@ 0x00000020) desc ALARMB                                                */

    struct {
      __IOM uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
      __IOM uint32_t SECONDEN   : 1;            /*!< [7..7] desc SECONDEN                                                      */
      __IOM uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
      __IOM uint32_t MINUTEEN   : 1;            /*!< [15..15] desc MINUTEEN                                                    */
      __IOM uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t HOUREN     : 1;            /*!< [23..23] desc HOUREN                                                      */
      __IOM uint32_t WEEKMASK   : 7;            /*!< [30..24] desc WEEKMASK                                                    */
    } ALARMB_f;
  } ;

  union {
    __IM  uint32_t TAMPDATE;                    /*!< (@ 0x00000024) desc TAMPDATE                                              */

    struct {
      __IM  uint32_t DAY        : 6;            /*!< [5..0] desc DAY                                                           */
      __IM  uint32_t            : 2;
      __IM  uint32_t MONTH      : 5;            /*!< [12..8] desc MONTH                                                        */
      __IM  uint32_t WEEK       : 3;            /*!< [15..13] desc WEEK                                                        */
    } TAMPDATE_f;
  } ;

  union {
    __IM  uint32_t TAMPTIME;                    /*!< (@ 0x00000028) desc TAMPTIME                                              */

    struct {
      __IM  uint32_t SECOND     : 7;            /*!< [6..0] desc SECOND                                                        */
      __IM  uint32_t            : 1;
      __IM  uint32_t MINUTE     : 7;            /*!< [14..8] desc MINUTE                                                       */
      __IM  uint32_t            : 1;
      __IM  uint32_t HOUR       : 6;            /*!< [21..16] desc HOUR                                                        */
    } TAMPTIME_f;
  } ;

  union {
    __IOM uint32_t AWTARR;                      /*!< (@ 0x0000002C) desc AWTARR                                                */

    struct {
      __IOM uint32_t ARR        : 16;           /*!< [15..0] desc ARR                                                          */
    } AWTARR_f;
  } ;

  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000030) desc IER                                                   */

    struct {
      __IOM uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
      __IOM uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
      __IOM uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
      __IOM uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
      __IOM uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
    } IER_f;
  } ;

  union {
    __IM  uint32_t ISR;                         /*!< (@ 0x00000034) desc ISR                                                   */

