hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IM  uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
      __IM  uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
      __IM  uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
      __IM  uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
      __IM  uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
      __IM  uint32_t            : 1;
      __IM  uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
    } ISR_f;
  } ;

  union {
    __IOM uint32_t ICR;                         /*!< (@ 0x00000038) desc ICR                                                   */

    struct {
      __IOM uint32_t ALARMA     : 1;            /*!< [0..0] desc ALARMA                                                        */
      __IOM uint32_t ALARMB     : 1;            /*!< [1..1] desc ALARMB                                                        */
      __IOM uint32_t AWTIMER    : 1;            /*!< [2..2] desc AWTIMER                                                       */
      __IOM uint32_t TAMP       : 1;            /*!< [3..3] desc TAMP                                                          */
      __IOM uint32_t TAMPOV     : 1;            /*!< [4..4] desc TAMPOV                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t INTERVAL   : 1;            /*!< [6..6] desc INTERVAL                                                      */
    } ICR_f;
  } ;

  union {
    __IM  uint32_t AWTCNT;                      /*!< (@ 0x0000003C) desc AWTCNT                                                */

    struct {
      __IM  uint32_t CNT        : 16;           /*!< [15..0] desc CNT                                                          */
    } AWTCNT_f;
  } ;

  union {
    __IOM uint32_t PSC;                         /*!< (@ 0x00000040) desc PSC                                                   */

    struct {
      __IOM uint32_t PSC2       : 20;           /*!< [19..0] desc PSC2                                                         */
      __IOM uint32_t PSC1       : 8;            /*!< [27..20] desc PSC1                                                        */
    } PSC_f;
  } ;

  union {
    __IM  uint32_t SSCNT;                       /*!< (@ 0x00000044) desc SSCNT                                                 */

    struct {
      __IM  uint32_t SSCNT0     : 20;           /*!< [19..0] desc SSCNT0                                                       */
      __IM  uint32_t SSCNT1     : 1;            /*!< [20..20] desc SSCNT1                                                      */
    } SSCNT_f;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t COMPCFR2;                    /*!< (@ 0x00000054) desc COMPCFR2                                              */

    struct {
      __IOM uint32_t PCLKCNT    : 11;           /*!< [10..0] desc PCLKCNT                                                      */
    } COMPCFR2_f;
  } ;

  union {
    __IOM uint32_t COMPCFR3;                    /*!< (@ 0x00000058) desc COMPCFR3                                              */

    struct {
      __IOM uint32_t PCLKCNT    : 11;           /*!< [10..0] desc PCLKCNT                                                      */
    } COMPCFR3_f;
  } ;
} RTC_TypeDef;                                     /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc SPI (SPI)
  */

typedef struct {                                /*!< (@ 0x40000800) SPI Structure                                              */

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000000) Control register1                                          */

    struct {
      __IOM uint32_t MSTR       : 1;            /*!< [0..0] desc MSTR                                                          */
      __IOM uint32_t SSM        : 1;            /*!< [1..1] desc SSM                                                           */
      __IOM uint32_t CPHA       : 1;            /*!< [2..2] desc CPHA                                                          */
      __IOM uint32_t CPOL       : 1;            /*!< [3..3] desc CPOL                                                          */
      __IOM uint32_t BR         : 3;            /*!< [6..4] desc BR                                                            */
      __IOM uint32_t LSBF       : 1;            /*!< [7..7] desc LSBF                                                          */
      __IOM uint32_t WIDTH      : 4;            /*!< [11..8] desc WIDTH                                                        */
      __IOM uint32_t GAP        : 4;            /*!< [15..12] desc GAP                                                         */
      __IOM uint32_t MODE       : 2;            /*!< [17..16] desc MODE                                                        */
      __IOM uint32_t FLTEN      : 1;            /*!< [18..18] desc FLTEN                                                       */
      __IOM uint32_t MISOHD     : 1;            /*!< [19..19] desc MISOHD                                                      */
      __IOM uint32_t SMP        : 1;            /*!< [20..20] desc SMP                                                         */
    } CR1_f;
  } ;

  union {
    __IOM uint32_t CR2;                         /*!< (@ 0x00000004) Control register2                                          */

