hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
            uint32_t            : 10;
      __IOM uint32_t KEY        : 16;           /*!< desc KEY                                                                  */
    } AHBEN_f;
  } ;

  union {
    __IOM uint32_t APBEN2;                      /*!< (@ 0x00000034) APB Clock Control Reg2                                     */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [1..1] desc RTC                                                           */
      __IOM uint32_t BTIM123    : 1;            /*!< [2..2] desc BTIM123                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t I2C1       : 1;            /*!< [6..6] desc I2C1                                                          */
      __IOM uint32_t LPTIM      : 1;            /*!< [7..7] desc LPTIM                                                         */
            uint32_t            : 8;
      __IOM uint32_t KEY        : 16;           /*!< desc KEY                                                                  */
    } APBEN2_f;
  } ;

  union {
    __IOM uint32_t APBEN1;                      /*!< (@ 0x00000038) APB Clock Control Reg1                                     */

    struct {
      __IOM uint32_t ADC        : 1;            /*!< [0..0] desc ADC                                                           */
      __IOM uint32_t VC         : 1;            /*!< [1..1] desc VC                                                            */
      __IOM uint32_t SPI1       : 1;            /*!< [2..2] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [3..3] desc UART1                                                         */
      __IOM uint32_t UART2      : 1;            /*!< [4..4] desc UART2                                                         */
      __IOM uint32_t ATIM       : 1;            /*!< [5..5] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [6..6] desc GTIM1                                                         */
            uint32_t            : 9;
      __IOM uint32_t KEY        : 16;           /*!< desc KEY                                                                  */
    } APBEN1_f;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t AHBRST;                      /*!< (@ 0x00000040) AHB Reset Control Reg                                      */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t FLASH      : 1;            /*!< [1..1] desc FLASH                                                         */
      __IOM uint32_t CRC        : 1;            /*!< [2..2] desc CRC                                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t GPIOA      : 1;            /*!< [4..4] desc GPIOA                                                         */
      __IOM uint32_t GPIOB      : 1;            /*!< [5..5] desc GPIOB                                                         */
    } AHBRST_f;
  } ;

  union {
    __IOM uint32_t APBRST2;                     /*!< (@ 0x00000044) APB Reset Control Reg2                                     */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t RTC        : 1;            /*!< [1..1] desc RTC                                                           */
      __IOM uint32_t BTIM123    : 1;            /*!< [2..2] desc BTIM123                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t I2C1       : 1;            /*!< [6..6] desc I2C1                                                          */
      __IOM uint32_t LPTIM      : 1;            /*!< [7..7] desc LPTIM                                                         */
    } APBRST2_f;
  } ;

  union {
    __IOM uint32_t APBRST1;                     /*!< (@ 0x00000048) APB Reset Control Reg1                                     */

    struct {
      __IOM uint32_t ADC        : 1;            /*!< [0..0] desc ADC                                                           */
      __IOM uint32_t VC         : 1;            /*!< [1..1] desc VC                                                            */
      __IOM uint32_t SPI1       : 1;            /*!< [2..2] desc SPI1                                                          */
      __IOM uint32_t UART1      : 1;            /*!< [3..3] desc UART1                                                         */
      __IOM uint32_t UART2      : 1;            /*!< [4..4] desc UART2                                                         */
      __IOM uint32_t ATIM       : 1;            /*!< [5..5] desc ATIM                                                          */
      __IOM uint32_t GTIM1      : 1;            /*!< [6..6] desc GTIM1                                                         */
    } APBRST1_f;
  } ;

  union {
    __IOM uint32_t RESETFLAG;                   /*!< (@ 0x0000004C) Reset Status Reg                                           */

