hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
    struct {
      __IOM uint32_t POR        : 1;            /*!< [0..0] desc POR                                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t LVD        : 1;            /*!< [3..3] desc LVD                                                           */
      __IOM uint32_t IWDT       : 1;            /*!< [4..4] desc IWDT                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t RSTB       : 1;            /*!< [6..6] desc RSTB                                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t LOCKUP     : 1;            /*!< [8..8] desc LOCKUP                                                        */
      __IOM uint32_t SYSRESETREQ : 1;           /*!< [9..9] desc SYSRESETREQ                                                   */
    } RESETFLAG_f;
  } ;
  __IM  uint32_t  RESERVED2[8];

  union {
    __IOM uint32_t MCO;                         /*!< (@ 0x00000070) Master Clock Output Control Reg                            */

    struct {
      __IOM uint32_t SOURCE     : 4;            /*!< [3..0] desc SOURCE                                                        */
      __IOM uint32_t DIV        : 3;            /*!< [6..4] desc DIV                                                           */
    } MCO_f;
  } ;
} SYSCTRL_TypeDef;                                 /*!< Size = 116 (0x74)                                                         */



/* =========================================================================================================================== */
/* ================                                            VC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief desc VC1 (VC1)
  */

typedef struct {                                /*!< (@ 0x400000A4) VC1 Structure                                              */

  union {
    __IOM uint32_t CR0;                         /*!< (@ 0x00000000) VC Control register0                                       */

    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] desc EN                                                            */
      __IOM uint32_t RESP       : 1;            /*!< [1..1] desc RESP                                                          */
      __IOM uint32_t HYS        : 1;            /*!< [2..2] desc HYS                                                           */
      __IOM uint32_t IE         : 1;            /*!< [3..3] desc IE                                                            */
      __IOM uint32_t POL        : 1;            /*!< [4..4] desc POL                                                           */
      __IOM uint32_t WINDOW     : 1;            /*!< [5..5] desc WINDOW                                                        */
      __IOM uint32_t INP        : 2;            /*!< [7..6] desc PCHANNEL                                                      */
      __IOM uint32_t INN        : 2;            /*!< [9..8] desc NCHANNEL                                                      */
    } CR0_f;
  } ;

  union {
    __IOM uint32_t CR1;                         /*!< (@ 0x00000004) VC Control register1                                       */

    struct {
      __IOM uint32_t FLTTIME    : 4;            /*!< [3..0] desc FLTTIME                                                       */
      __IOM uint32_t FLTCLK     : 1;            /*!< [4..4] desc FLTCLK                                                        */
      __IOM uint32_t FALLIE     : 1;            /*!< [5..5] desc FALLIE                                                        */
      __IOM uint32_t RISEIE     : 1;            /*!< [6..6] desc RISEIE                                                        */
      __IOM uint32_t HIGHIE     : 1;            /*!< [7..7] desc HIGHIE                                                        */
      __IOM uint32_t BLANKATCH1 : 1;            /*!< [8..8] desc BLANKATCH1                                                           */
      __IOM uint32_t BLANKATCH2 : 1;            /*!< [9..9] desc BLANKATCH2                                                           */
      __IOM uint32_t BLANKATCH3 : 1;            /*!< [10..10] desc BLANKATCH3                                                           */
      __IOM uint32_t BLANKATCH4 : 1;            /*!< [11..11] desc BLANKATCH4                                                           */
      __IOM uint32_t BLANKATCH5 : 1;            /*!< [12..12] desc BLANKATCH5                                                           */
      __IOM uint32_t BLANKATCH6 : 1;            /*!< [13..13] desc BLANKATCH6                                                           */
      __IOM uint32_t BLANKTIME  : 3;            /*!< [16..14] desc BLANKTIME                                                            */
      __IOM uint32_t BLANKLVL   : 1;            /*!< [17..17] desc BLANKLVL                                                             */
    } CR1_f;
  } ;

  union {
    __IOM uint32_t SR;                          /*!< (@ 0x00000008) VC State REG                                               */

    struct {
      __IOM uint32_t INTF       : 1;            /*!< [0..0] desc INTF                                                          */
      __IM  uint32_t FLTV       : 1;            /*!< [1..1] desc FLTV                                                          */
    } SR_f;
  } ;
} VC_TypeDef;                                      /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           VCREF                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief desc VCREF (VCREF)
  */

typedef struct {                                /*!< (@ 0x400000A0) VCREF Structure                                            */

  union {
    __IOM uint32_t CR;                          /*!< (@ 0x00000000) VCREF Control register                                     */

