hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
/* ==========================================================  CR  =========================================================== */
#define ADC_CR_ENS_Pos                    (6UL)                     /*!< ENS (Bit 6)                                           */
#define ADC_CR_ENS_Msk                    (0x1c0UL)                 /*!< ENS (Bitfield-Mask: 0x07)                             */
#define ADC_CR_CLK_Pos                    (4UL)                     /*!< CLK (Bit 4)                                           */
#define ADC_CR_CLK_Msk                    (0x30UL)                  /*!< CLK (Bitfield-Mask: 0x03)                             */
#define ADC_CR_CONT_Pos                   (3UL)                     /*!< CONT (Bit 3)                                          */
#define ADC_CR_CONT_Msk                   (0x8UL)                   /*!< CONT (Bitfield-Mask: 0x01)                            */
#define ADC_CR_TSEN_Pos                   (2UL)                     /*!< TSEN (Bit 2)                                          */
#define ADC_CR_TSEN_Msk                   (0x4UL)                   /*!< TSEN (Bitfield-Mask: 0x01)                            */
#define ADC_CR_BGREN_Pos                  (1UL)                     /*!< BGREN (Bit 1)                                         */
#define ADC_CR_BGREN_Msk                  (0x2UL)                   /*!< BGREN (Bitfield-Mask: 0x01)                           */
#define ADC_CR_EN_Pos                     (0UL)                     /*!< EN (Bit 0)                                            */
#define ADC_CR_EN_Msk                     (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* =========================================================  START  ========================================================= */
#define ADC_START_START_Pos               (0UL)                     /*!< START (Bit 0)                                         */
#define ADC_START_START_Msk               (0x1UL)                   /*!< START (Bitfield-Mask: 0x01)                           */
/* ========================================================  SQRCFR  ========================================================= */
#define ADC_SQRCFR_SQRCH7_Pos             (28UL)                    /*!< SQRCH7 (Bit 28)                                       */
#define ADC_SQRCFR_SQRCH7_Msk             (0xf0000000UL)            /*!< SQRCH7 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH6_Pos             (24UL)                    /*!< SQRCH6 (Bit 24)                                       */
#define ADC_SQRCFR_SQRCH6_Msk             (0xf000000UL)             /*!< SQRCH6 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH5_Pos             (20UL)                    /*!< SQRCH5 (Bit 20)                                       */
#define ADC_SQRCFR_SQRCH5_Msk             (0xf00000UL)              /*!< SQRCH5 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH4_Pos             (16UL)                    /*!< SQRCH4 (Bit 16)                                       */
#define ADC_SQRCFR_SQRCH4_Msk             (0xf0000UL)               /*!< SQRCH4 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH3_Pos             (12UL)                    /*!< SQRCH3 (Bit 12)                                       */
#define ADC_SQRCFR_SQRCH3_Msk             (0xf000UL)                /*!< SQRCH3 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH2_Pos             (8UL)                     /*!< SQRCH2 (Bit 8)                                        */
#define ADC_SQRCFR_SQRCH2_Msk             (0xf00UL)                 /*!< SQRCH2 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH1_Pos             (4UL)                     /*!< SQRCH1 (Bit 4)                                        */
#define ADC_SQRCFR_SQRCH1_Msk             (0xf0UL)                  /*!< SQRCH1 (Bitfield-Mask: 0x0f)                          */
#define ADC_SQRCFR_SQRCH0_Pos             (0UL)                     /*!< SQRCH0 (Bit 0)                                        */
#define ADC_SQRCFR_SQRCH0_Msk             (0xfUL)                   /*!< SQRCH0 (Bitfield-Mask: 0x0f)                          */
/* =========================================================  AWDTR  ========================================================= */
#define ADC_AWDTR_VTH_Pos                 (16UL)                    /*!< VTH (Bit 16)                                          */
#define ADC_AWDTR_VTH_Msk                 (0xfff0000UL)             /*!< VTH (Bitfield-Mask: 0xfff)                            */
#define ADC_AWDTR_VTL_Pos                 (0UL)                     /*!< VTL (Bit 0)                                           */
#define ADC_AWDTR_VTL_Msk                 (0xfffUL)                 /*!< VTL (Bitfield-Mask: 0xfff)                            */
/* =========================================================  AWDCR  ========================================================= */
#define ADC_AWDCR_IN15_Pos                (15UL)                    /*!< IN15 (Bit 15)                                         */
#define ADC_AWDCR_IN15_Msk                (0x8000UL)                /*!< IN15 (Bitfield-Mask: 0x01)                            */
#define ADC_AWDCR_IN14_Pos                (14UL)                    /*!< IN14 (Bit 14)                                         */
#define ADC_AWDCR_IN14_Msk                (0x4000UL)                /*!< IN14 (Bitfield-Mask: 0x01)                            */
#define ADC_AWDCR_IN13_Pos                (13UL)                    /*!< IN13 (Bit 13)                                         */
#define ADC_AWDCR_IN13_Msk                (0x2000UL)                /*!< IN13 (Bitfield-Mask: 0x01)                            */
#define ADC_AWDCR_IN12_Pos                (12UL)                    /*!< IN12 (Bit 12)                                         */
#define ADC_AWDCR_IN12_Msk                (0x1000UL)                /*!< IN12 (Bitfield-Mask: 0x01)                            */
#define ADC_AWDCR_IN11_Pos                (11UL)                    /*!< IN11 (Bit 11)                                         */
#define ADC_AWDCR_IN11_Msk                (0x800UL)                 /*!< IN11 (Bitfield-Mask: 0x01)                            */
#define ADC_AWDCR_IN10_Pos                (10UL)                    /*!< IN10 (Bit 10)                                         */
#define ADC_AWDCR_IN10_Msk                (0x400UL)                 /*!< IN10 (Bitfield-Mask: 0x01)                            */
#define ADC_AWDCR_IN9_Pos                 (9UL)                     /*!< IN9 (Bit 9)                                           */
#define ADC_AWDCR_IN9_Msk                 (0x200UL)                 /*!< IN9 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN8_Pos                 (8UL)                     /*!< IN8 (Bit 8)                                           */
#define ADC_AWDCR_IN8_Msk                 (0x100UL)                 /*!< IN8 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN7_Pos                 (7UL)                     /*!< IN7 (Bit 7)                                           */
#define ADC_AWDCR_IN7_Msk                 (0x80UL)                  /*!< IN7 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN6_Pos                 (6UL)                     /*!< IN6 (Bit 6)                                           */
#define ADC_AWDCR_IN6_Msk                 (0x40UL)                  /*!< IN6 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN5_Pos                 (5UL)                     /*!< IN5 (Bit 5)                                           */
#define ADC_AWDCR_IN5_Msk                 (0x20UL)                  /*!< IN5 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN4_Pos                 (4UL)                     /*!< IN4 (Bit 4)                                           */
#define ADC_AWDCR_IN4_Msk                 (0x10UL)                  /*!< IN4 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN3_Pos                 (3UL)                     /*!< IN3 (Bit 3)                                           */
#define ADC_AWDCR_IN3_Msk                 (0x8UL)                   /*!< IN3 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN2_Pos                 (2UL)                     /*!< IN2 (Bit 2)                                           */
#define ADC_AWDCR_IN2_Msk                 (0x4UL)                   /*!< IN2 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN1_Pos                 (1UL)                     /*!< IN1 (Bit 1)                                           */
#define ADC_AWDCR_IN1_Msk                 (0x2UL)                   /*!< IN1 (Bitfield-Mask: 0x01)                             */
#define ADC_AWDCR_IN0_Pos                 (0UL)                     /*!< IN0 (Bit 0)                                           */
#define ADC_AWDCR_IN0_Msk                 (0x1UL)                   /*!< IN0 (Bitfield-Mask: 0x01)                             */
/* ========================================================  SAMPLE  ========================================================= */
#define ADC_SAMPLE_SQRCH7_Pos             (28UL)                    /*!< SQRCH7 (Bit 28)                                       */
#define ADC_SAMPLE_SQRCH7_Msk             (0xf0000000UL)            /*!< SQRCH7 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH6_Pos             (24UL)                    /*!< SQRCH6 (Bit 24)                                       */
#define ADC_SAMPLE_SQRCH6_Msk             (0xf000000UL)             /*!< SQRCH6 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH5_Pos             (20UL)                    /*!< SQRCH5 (Bit 20)                                       */
#define ADC_SAMPLE_SQRCH5_Msk             (0xf00000UL)              /*!< SQRCH5 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH4_Pos             (16UL)                    /*!< SQRCH4 (Bit 16)                                       */
#define ADC_SAMPLE_SQRCH4_Msk             (0xf0000UL)               /*!< SQRCH4 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH3_Pos             (12UL)                    /*!< SQRCH3 (Bit 12)                                       */
#define ADC_SAMPLE_SQRCH3_Msk             (0xf000UL)                /*!< SQRCH3 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH2_Pos             (8UL)                     /*!< SQRCH2 (Bit 8)                                        */
#define ADC_SAMPLE_SQRCH2_Msk             (0xf00UL)                 /*!< SQRCH2 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH1_Pos             (4UL)                     /*!< SQRCH1 (Bit 4)                                        */
#define ADC_SAMPLE_SQRCH1_Msk             (0xf0UL)                  /*!< SQRCH1 (Bitfield-Mask: 0x0f)                          */
#define ADC_SAMPLE_SQRCH0_Pos             (0UL)                     /*!< SQRCH0 (Bit 0)                                        */
#define ADC_SAMPLE_SQRCH0_Msk             (0xfUL)                   /*!< SQRCH0 (Bitfield-Mask: 0x0f)                          */
/* ========================================================  TRIGGER  ======================================================== */
#define ADC_TRIGGER_UART2_Pos             (18UL)                    /*!< UART2 (Bit 18)                                        */
#define ADC_TRIGGER_UART2_Msk             (0x40000UL)               /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_UART1_Pos             (17UL)                    /*!< UART1 (Bit 17)                                        */
#define ADC_TRIGGER_UART1_Msk             (0x20000UL)               /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define ADC_TRIGGER_SPI1_Pos              (16UL)                    /*!< SPI1 (Bit 16)                                         */
#define ADC_TRIGGER_SPI1_Msk              (0x10000UL)               /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define ADC_TRIGGER_BTIM3TRGO_Pos         (15UL)                    /*!< BTIM3TRGO (Bit 15)                                    */
#define ADC_TRIGGER_BTIM3TRGO_Msk         (0x8000UL)                /*!< BTIM3TRGO (Bitfield-Mask: 0x01)                       */
#define ADC_TRIGGER_BTIM2TRGO_Pos         (14UL)                    /*!< BTIM2TRGO (Bit 14)                                    */
#define ADC_TRIGGER_BTIM2TRGO_Msk         (0x4000UL)                /*!< BTIM2TRGO (Bitfield-Mask: 0x01)                       */
#define ADC_TRIGGER_BTIM1TRGO_Pos         (13UL)                    /*!< BTIM1TRGO (Bit 13)                                    */
#define ADC_TRIGGER_BTIM1TRGO_Msk         (0x2000UL)                /*!< BTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define ADC_TRIGGER_GTIM1CC4_Pos          (12UL)                    /*!< GTIM1CC4 (Bit 12)                                     */
#define ADC_TRIGGER_GTIM1CC4_Msk          (0x1000UL)                /*!< GTIM1CC4 (Bitfield-Mask: 0x01)                        */
#define ADC_TRIGGER_GTIM1CC3_Pos          (11UL)                    /*!< GTIM1CC3 (Bit 11)                                     */
#define ADC_TRIGGER_GTIM1CC3_Msk          (0x800UL)                 /*!< GTIM1CC3 (Bitfield-Mask: 0x01)                        */
#define ADC_TRIGGER_GTIM1CC2_Pos          (10UL)                    /*!< GTIM1CC2 (Bit 10)                                     */
#define ADC_TRIGGER_GTIM1CC2_Msk          (0x400UL)                 /*!< GTIM1CC2 (Bitfield-Mask: 0x01)                        */
#define ADC_TRIGGER_GTIM1CC1_Pos          (9UL)                     /*!< GTIM1CC1 (Bit 9)                                      */
#define ADC_TRIGGER_GTIM1CC1_Msk          (0x200UL)                 /*!< GTIM1CC1 (Bitfield-Mask: 0x01)                        */
#define ADC_TRIGGER_GTIM1TRGO_Pos         (8UL)                     /*!< GTIM1TRGO (Bit 8)                                     */
#define ADC_TRIGGER_GTIM1TRGO_Msk         (0x100UL)                 /*!< GTIM1TRGO (Bitfield-Mask: 0x01)                       */
#define ADC_TRIGGER_ATIMCC6_Pos           (7UL)                     /*!< ATIMCC6 (Bit 7)                                       */
#define ADC_TRIGGER_ATIMCC6_Msk           (0x80UL)                  /*!< ATIMCC6 (Bitfield-Mask: 0x01)                         */
#define ADC_TRIGGER_ATIMCC5_Pos           (6UL)                     /*!< ATIMCC5 (Bit 6)                                       */
#define ADC_TRIGGER_ATIMCC5_Msk           (0x40UL)                  /*!< ATIMCC5 (Bitfield-Mask: 0x01)                         */
#define ADC_TRIGGER_ATIMCC4_Pos           (5UL)                     /*!< ATIMCC4 (Bit 5)                                       */
#define ADC_TRIGGER_ATIMCC4_Msk           (0x20UL)                  /*!< ATIMCC4 (Bitfield-Mask: 0x01)                         */
#define ADC_TRIGGER_ATIMCC3_Pos           (4UL)                     /*!< ATIMCC3 (Bit 4)                                       */
#define ADC_TRIGGER_ATIMCC3_Msk           (0x10UL)                  /*!< ATIMCC3 (Bitfield-Mask: 0x01)                         */
#define ADC_TRIGGER_ATIMCC2_Pos           (3UL)                     /*!< ATIMCC2 (Bit 3)                                       */
#define ADC_TRIGGER_ATIMCC2_Msk           (0x8UL)                   /*!< ATIMCC2 (Bitfield-Mask: 0x01)                         */
#define ADC_TRIGGER_ATIMCC1_Pos           (2UL)                     /*!< ATIMCC1 (Bit 2)                                       */
#define ADC_TRIGGER_ATIMCC1_Msk           (0x4UL)                   /*!< ATIMCC1 (Bitfield-Mask: 0x01)                         */
#define ADC_TRIGGER_ATIMTRGO2_Pos         (1UL)                     /*!< ATIMTRGO2 (Bit 1)                                     */
#define ADC_TRIGGER_ATIMTRGO2_Msk         (0x2UL)                   /*!< ATIMTRGO2 (Bitfield-Mask: 0x01)                       */
#define ADC_TRIGGER_ATIMTRGO_Pos          (0UL)                     /*!< ATIMTRGO (Bit 0)                                      */
#define ADC_TRIGGER_ATIMTRGO_Msk          (0x1UL)                   /*!< ATIMTRGO (Bitfield-Mask: 0x01)                        */
/* ==========================================================  IER  ========================================================== */
#define ADC_IER_AWDH_Pos                  (3UL)                     /*!< AWDH (Bit 3)                                          */
#define ADC_IER_AWDH_Msk                  (0x8UL)                   /*!< AWDH (Bitfield-Mask: 0x01)                            */
#define ADC_IER_AWDL_Pos                  (2UL)                     /*!< AWDL (Bit 2)                                          */
#define ADC_IER_AWDL_Msk                  (0x4UL)                   /*!< AWDL (Bitfield-Mask: 0x01)                            */
#define ADC_IER_EOS_Pos                   (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADC_IER_EOS_Msk                   (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADC_IER_EOC_Pos                   (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADC_IER_EOC_Msk                   (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define ADC_ISR_AWDH_Pos                  (3UL)                     /*!< AWDH (Bit 3)                                          */
#define ADC_ISR_AWDH_Msk                  (0x8UL)                   /*!< AWDH (Bitfield-Mask: 0x01)                            */
#define ADC_ISR_AWDL_Pos                  (2UL)                     /*!< AWDL (Bit 2)                                          */
#define ADC_ISR_AWDL_Msk                  (0x4UL)                   /*!< AWDL (Bitfield-Mask: 0x01)                            */
#define ADC_ISR_EOS_Pos                   (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADC_ISR_EOS_Msk                   (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADC_ISR_EOC_Pos                   (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADC_ISR_EOC_Msk                   (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define ADC_ICR_AWDH_Pos                  (3UL)                     /*!< AWDH (Bit 3)                                          */
#define ADC_ICR_AWDH_Msk                  (0x8UL)                   /*!< AWDH (Bitfield-Mask: 0x01)                            */
#define ADC_ICR_AWDL_Pos                  (2UL)                     /*!< AWDL (Bit 2)                                          */
#define ADC_ICR_AWDL_Msk                  (0x4UL)                   /*!< AWDL (Bitfield-Mask: 0x01)                            */
#define ADC_ICR_EOS_Pos                   (1UL)                     /*!< EOS (Bit 1)                                           */
#define ADC_ICR_EOS_Msk                   (0x2UL)                   /*!< EOS (Bitfield-Mask: 0x01)                             */
#define ADC_ICR_EOC_Pos                   (0UL)                     /*!< EOC (Bit 0)                                           */
#define ADC_ICR_EOC_Msk                   (0x1UL)                   /*!< EOC (Bitfield-Mask: 0x01)                             */
/* ========================================================  RESULT0  ======================================================== */
#define ADC_RESULT0_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT0_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT1  ======================================================== */
#define ADC_RESULT1_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT1_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT2  ======================================================== */
#define ADC_RESULT2_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT2_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT3  ======================================================== */
#define ADC_RESULT3_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT3_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT4  ======================================================== */
#define ADC_RESULT4_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT4_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT5  ======================================================== */
#define ADC_RESULT5_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT5_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT6  ======================================================== */
#define ADC_RESULT6_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT6_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */
/* ========================================================  RESULT7  ======================================================== */
#define ADC_RESULT7_RESULT_Pos            (0UL)                     /*!< RESULT (Bit 0)                                        */
#define ADC_RESULT7_RESULT_Msk            (0xffffUL)                /*!< RESULT (Bitfield-Mask: 0xffff)                        */


/* =========================================================================================================================== */
/* ================                                           ATIM                                            ================ */
/* =========================================================================================================================== */

