hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
#define ATIM_CCMR1CAP_CC2S_Msk            (0x300UL)                 /*!< CC2S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR1CAP_IC1F_Pos            (4UL)                     /*!< IC1F (Bit 4)                                          */
#define ATIM_CCMR1CAP_IC1F_Msk            (0xf0UL)                  /*!< IC1F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR1CAP_IC1PSC_Pos          (2UL)                     /*!< IC1PSC (Bit 2)                                        */
#define ATIM_CCMR1CAP_IC1PSC_Msk          (0xcUL)                   /*!< IC1PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR1CAP_CC1S_Pos            (0UL)                     /*!< CC1S (Bit 0)                                          */
#define ATIM_CCMR1CAP_CC1S_Msk            (0x3UL)                   /*!< CC1S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR1CMP  ======================================================== */
#define ATIM_CCMR1CMP_OC2MH_Pos           (24UL)                    /*!< OC2MH (Bit 24)                                        */
#define ATIM_CCMR1CMP_OC2MH_Msk           (0x1000000UL)             /*!< OC2MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_OC1MH_Pos           (16UL)                    /*!< OC1MH (Bit 16)                                        */
#define ATIM_CCMR1CMP_OC1MH_Msk           (0x10000UL)               /*!< OC1MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_OC2CE_Pos           (15UL)                    /*!< OC2CE (Bit 15)                                        */
#define ATIM_CCMR1CMP_OC2CE_Msk           (0x8000UL)                /*!< OC2CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_OC2M_Pos            (12UL)                    /*!< OC2M (Bit 12)                                         */
#define ATIM_CCMR1CMP_OC2M_Msk            (0x7000UL)                /*!< OC2M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR1CMP_OC2PE_Pos           (11UL)                    /*!< OC2PE (Bit 11)                                        */
#define ATIM_CCMR1CMP_OC2PE_Msk           (0x800UL)                 /*!< OC2PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_OC2FE_Pos           (10UL)                    /*!< OC2FE (Bit 10)                                        */
#define ATIM_CCMR1CMP_OC2FE_Msk           (0x400UL)                 /*!< OC2FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_CC2S_Pos            (8UL)                     /*!< CC2S (Bit 8)                                          */
#define ATIM_CCMR1CMP_CC2S_Msk            (0x300UL)                 /*!< CC2S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR1CMP_OC1CE_Pos           (7UL)                     /*!< OC1CE (Bit 7)                                         */
#define ATIM_CCMR1CMP_OC1CE_Msk           (0x80UL)                  /*!< OC1CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_OC1M_Pos            (4UL)                     /*!< OC1M (Bit 4)                                          */
#define ATIM_CCMR1CMP_OC1M_Msk            (0x70UL)                  /*!< OC1M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR1CMP_OC1PE_Pos           (3UL)                     /*!< OC1PE (Bit 3)                                         */
#define ATIM_CCMR1CMP_OC1PE_Msk           (0x8UL)                   /*!< OC1PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_OC1FE_Pos           (2UL)                     /*!< OC1FE (Bit 2)                                         */
#define ATIM_CCMR1CMP_OC1FE_Msk           (0x4UL)                   /*!< OC1FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR1CMP_CC1S_Pos            (0UL)                     /*!< CC1S (Bit 0)                                          */
#define ATIM_CCMR1CMP_CC1S_Msk            (0x3UL)                   /*!< CC1S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CAP  ======================================================== */
#define ATIM_CCMR2CAP_IC4F_Pos            (12UL)                    /*!< IC4F (Bit 12)                                         */
#define ATIM_CCMR2CAP_IC4F_Msk            (0xf000UL)                /*!< IC4F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR2CAP_IC4PSC_Pos          (10UL)                    /*!< IC4PSC (Bit 10)                                       */
#define ATIM_CCMR2CAP_IC4PSC_Msk          (0xc00UL)                 /*!< IC4PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR2CAP_CC4S_Pos            (8UL)                     /*!< CC4S (Bit 8)                                          */
#define ATIM_CCMR2CAP_CC4S_Msk            (0x300UL)                 /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR2CAP_IC3F_Pos            (4UL)                     /*!< IC3F (Bit 4)                                          */
#define ATIM_CCMR2CAP_IC3F_Msk            (0xf0UL)                  /*!< IC3F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR2CAP_IC3PSC_Pos          (2UL)                     /*!< IC3PSC (Bit 2)                                        */
#define ATIM_CCMR2CAP_IC3PSC_Msk          (0xcUL)                   /*!< IC3PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR2CAP_CC3S_Pos            (0UL)                     /*!< CC3S (Bit 0)                                          */
#define ATIM_CCMR2CAP_CC3S_Msk            (0x3UL)                   /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CMP  ======================================================== */
#define ATIM_CCMR2CMP_OC4MH_Pos           (24UL)                    /*!< OC4MH (Bit 24)                                        */
#define ATIM_CCMR2CMP_OC4MH_Msk           (0x1000000UL)             /*!< OC4MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC3MH_Pos           (16UL)                    /*!< OC3MH (Bit 16)                                        */
#define ATIM_CCMR2CMP_OC3MH_Msk           (0x10000UL)               /*!< OC3MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC4CE_Pos           (15UL)                    /*!< OC4CE (Bit 15)                                        */
#define ATIM_CCMR2CMP_OC4CE_Msk           (0x8000UL)                /*!< OC4CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC4M_Pos            (12UL)                    /*!< OC4M (Bit 12)                                         */
#define ATIM_CCMR2CMP_OC4M_Msk            (0x7000UL)                /*!< OC4M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR2CMP_OC4PE_Pos           (11UL)                    /*!< OC4PE (Bit 11)                                        */
#define ATIM_CCMR2CMP_OC4PE_Msk           (0x800UL)                 /*!< OC4PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC4FE_Pos           (10UL)                    /*!< OC4FE (Bit 10)                                        */
#define ATIM_CCMR2CMP_OC4FE_Msk           (0x400UL)                 /*!< OC4FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_CC4S_Pos            (8UL)                     /*!< CC4S (Bit 8)                                          */
#define ATIM_CCMR2CMP_CC4S_Msk            (0x300UL)                 /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR2CMP_OC3CE_Pos           (7UL)                     /*!< OC3CE (Bit 7)                                         */
#define ATIM_CCMR2CMP_OC3CE_Msk           (0x80UL)                  /*!< OC3CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC3M_Pos            (4UL)                     /*!< OC3M (Bit 4)                                          */
#define ATIM_CCMR2CMP_OC3M_Msk            (0x70UL)                  /*!< OC3M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR2CMP_OC3PE_Pos           (3UL)                     /*!< OC3PE (Bit 3)                                         */
#define ATIM_CCMR2CMP_OC3PE_Msk           (0x8UL)                   /*!< OC3PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_OC3FE_Pos           (2UL)                     /*!< OC3FE (Bit 2)                                         */
#define ATIM_CCMR2CMP_OC3FE_Msk           (0x4UL)                   /*!< OC3FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR2CMP_CC3S_Pos            (0UL)                     /*!< CC3S (Bit 0)                                          */
#define ATIM_CCMR2CMP_CC3S_Msk            (0x3UL)                   /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR3CAP  ======================================================== */
#define ATIM_CCMR3CAP_IC6F_Pos            (12UL)                    /*!< IC6F (Bit 12)                                         */
#define ATIM_CCMR3CAP_IC6F_Msk            (0xf000UL)                /*!< IC6F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR3CAP_IC6PSC_Pos          (10UL)                    /*!< IC6PSC (Bit 10)                                       */
#define ATIM_CCMR3CAP_IC6PSC_Msk          (0xc00UL)                 /*!< IC6PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR3CAP_CC6S_Pos            (8UL)                     /*!< CC6S (Bit 8)                                          */
#define ATIM_CCMR3CAP_CC6S_Msk            (0x300UL)                 /*!< CC6S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR3CAP_IC5F_Pos            (4UL)                     /*!< IC5F (Bit 4)                                          */
#define ATIM_CCMR3CAP_IC5F_Msk            (0xf0UL)                  /*!< IC5F (Bitfield-Mask: 0x0f)                            */
#define ATIM_CCMR3CAP_IC5PSC_Pos          (2UL)                     /*!< IC5PSC (Bit 2)                                        */
#define ATIM_CCMR3CAP_IC5PSC_Msk          (0xcUL)                   /*!< IC5PSC (Bitfield-Mask: 0x03)                          */
#define ATIM_CCMR3CAP_CC5S_Pos            (0UL)                     /*!< CC5S (Bit 0)                                          */
#define ATIM_CCMR3CAP_CC5S_Msk            (0x3UL)                   /*!< CC5S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR3CMP  ======================================================== */
#define ATIM_CCMR3CMP_OC6MH_Pos           (24UL)                    /*!< OC6MH (Bit 24)                                        */
#define ATIM_CCMR3CMP_OC6MH_Msk           (0x1000000UL)             /*!< OC6MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC5MH_Pos           (16UL)                    /*!< OC5MH (Bit 16)                                        */
#define ATIM_CCMR3CMP_OC5MH_Msk           (0x10000UL)               /*!< OC5MH (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC6CE_Pos           (15UL)                    /*!< OC6CE (Bit 15)                                        */
#define ATIM_CCMR3CMP_OC6CE_Msk           (0x8000UL)                /*!< OC6CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC6M_Pos            (12UL)                    /*!< OC6M (Bit 12)                                         */
#define ATIM_CCMR3CMP_OC6M_Msk            (0x7000UL)                /*!< OC6M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR3CMP_OC6PE_Pos           (11UL)                    /*!< OC6PE (Bit 11)                                        */
#define ATIM_CCMR3CMP_OC6PE_Msk           (0x800UL)                 /*!< OC6PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC6FE_Pos           (10UL)                    /*!< OC6FE (Bit 10)                                        */
#define ATIM_CCMR3CMP_OC6FE_Msk           (0x400UL)                 /*!< OC6FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_CC6S_Pos            (8UL)                     /*!< CC6S (Bit 8)                                          */
#define ATIM_CCMR3CMP_CC6S_Msk            (0x300UL)                 /*!< CC6S (Bitfield-Mask: 0x03)                            */
#define ATIM_CCMR3CMP_OC5CE_Pos           (7UL)                     /*!< OC5CE (Bit 7)                                         */
#define ATIM_CCMR3CMP_OC5CE_Msk           (0x80UL)                  /*!< OC5CE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC5M_Pos            (4UL)                     /*!< OC5M (Bit 4)                                          */
#define ATIM_CCMR3CMP_OC5M_Msk            (0x70UL)                  /*!< OC5M (Bitfield-Mask: 0x07)                            */
#define ATIM_CCMR3CMP_OC5PE_Pos           (3UL)                     /*!< OC5PE (Bit 3)                                         */
#define ATIM_CCMR3CMP_OC5PE_Msk           (0x8UL)                   /*!< OC5PE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_OC5FE_Pos           (2UL)                     /*!< OC5FE (Bit 2)                                         */
#define ATIM_CCMR3CMP_OC5FE_Msk           (0x4UL)                   /*!< OC5FE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCMR3CMP_CC5S_Pos            (0UL)                     /*!< CC5S (Bit 0)                                          */
#define ATIM_CCMR3CMP_CC5S_Msk            (0x3UL)                   /*!< CC5S (Bitfield-Mask: 0x03)                            */
/* =========================================================  CCER  ========================================================== */
#define ATIM_CCER_CC6NP_Pos               (23UL)                    /*!< CC6NP (Bit 23)                                        */
#define ATIM_CCER_CC6NP_Msk               (0x800000UL)              /*!< CC6NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC6NE_Pos               (22UL)                    /*!< CC6NE (Bit 22)                                        */
#define ATIM_CCER_CC6NE_Msk               (0x400000UL)              /*!< CC6NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC6P_Pos                (21UL)                    /*!< CC6P (Bit 21)                                         */
#define ATIM_CCER_CC6P_Msk                (0x200000UL)              /*!< CC6P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC6E_Pos                (20UL)                    /*!< CC6E (Bit 20)                                         */
#define ATIM_CCER_CC6E_Msk                (0x100000UL)              /*!< CC6E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC5NP_Pos               (19UL)                    /*!< CC5NP (Bit 19)                                        */
#define ATIM_CCER_CC5NP_Msk               (0x80000UL)               /*!< CC5NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC5NE_Pos               (18UL)                    /*!< CC5NE (Bit 18)                                        */
#define ATIM_CCER_CC5NE_Msk               (0x40000UL)               /*!< CC5NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC5P_Pos                (17UL)                    /*!< CC5P (Bit 17)                                         */
#define ATIM_CCER_CC5P_Msk                (0x20000UL)               /*!< CC5P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC5E_Pos                (16UL)                    /*!< CC5E (Bit 16)                                         */
#define ATIM_CCER_CC5E_Msk                (0x10000UL)               /*!< CC5E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC4NP_Pos               (15UL)                    /*!< CC4NP (Bit 15)                                        */
#define ATIM_CCER_CC4NP_Msk               (0x8000UL)                /*!< CC4NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC4NE_Pos               (14UL)                    /*!< CC4NE (Bit 14)                                        */
#define ATIM_CCER_CC4NE_Msk               (0x4000UL)                /*!< CC4NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC4P_Pos                (13UL)                    /*!< CC4P (Bit 13)                                         */
#define ATIM_CCER_CC4P_Msk                (0x2000UL)                /*!< CC4P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC4E_Pos                (12UL)                    /*!< CC4E (Bit 12)                                         */
#define ATIM_CCER_CC4E_Msk                (0x1000UL)                /*!< CC4E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC3NP_Pos               (11UL)                    /*!< CC3NP (Bit 11)                                        */
#define ATIM_CCER_CC3NP_Msk               (0x800UL)                 /*!< CC3NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC3NE_Pos               (10UL)                    /*!< CC3NE (Bit 10)                                        */
#define ATIM_CCER_CC3NE_Msk               (0x400UL)                 /*!< CC3NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC3P_Pos                (9UL)                     /*!< CC3P (Bit 9)                                          */
#define ATIM_CCER_CC3P_Msk                (0x200UL)                 /*!< CC3P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC3E_Pos                (8UL)                     /*!< CC3E (Bit 8)                                          */
#define ATIM_CCER_CC3E_Msk                (0x100UL)                 /*!< CC3E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC2NP_Pos               (7UL)                     /*!< CC2NP (Bit 7)                                         */
#define ATIM_CCER_CC2NP_Msk               (0x80UL)                  /*!< CC2NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC2NE_Pos               (6UL)                     /*!< CC2NE (Bit 6)                                         */
#define ATIM_CCER_CC2NE_Msk               (0x40UL)                  /*!< CC2NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC2P_Pos                (5UL)                     /*!< CC2P (Bit 5)                                          */
#define ATIM_CCER_CC2P_Msk                (0x20UL)                  /*!< CC2P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC2E_Pos                (4UL)                     /*!< CC2E (Bit 4)                                          */
#define ATIM_CCER_CC2E_Msk                (0x10UL)                  /*!< CC2E (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC1NP_Pos               (3UL)                     /*!< CC1NP (Bit 3)                                         */
#define ATIM_CCER_CC1NP_Msk               (0x8UL)                   /*!< CC1NP (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC1NE_Pos               (2UL)                     /*!< CC1NE (Bit 2)                                         */
#define ATIM_CCER_CC1NE_Msk               (0x4UL)                   /*!< CC1NE (Bitfield-Mask: 0x01)                           */
#define ATIM_CCER_CC1P_Pos                (1UL)                     /*!< CC1P (Bit 1)                                          */
#define ATIM_CCER_CC1P_Msk                (0x2UL)                   /*!< CC1P (Bitfield-Mask: 0x01)                            */
#define ATIM_CCER_CC1E_Pos                (0UL)                     /*!< CC1E (Bit 0)                                          */
#define ATIM_CCER_CC1E_Msk                (0x1UL)                   /*!< CC1E (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CNT  ========================================================== */
#define ATIM_CNT_UIFCPY_Pos               (31UL)                    /*!< UIFCPY (Bit 31)                                       */
#define ATIM_CNT_UIFCPY_Msk               (0x80000000UL)            /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define ATIM_CNT_CNT_Pos                  (0UL)                     /*!< CNT (Bit 0)                                           */
#define ATIM_CNT_CNT_Msk                  (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define ATIM_PSC_PSC_Pos                  (0UL)                     /*!< PSC (Bit 0)                                           */
#define ATIM_PSC_PSC_Msk                  (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define ATIM_ARR_ARR_Pos                  (0UL)                     /*!< ARR (Bit 0)                                           */
#define ATIM_ARR_ARR_Msk                  (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  RCR  ========================================================== */
#define ATIM_RCR_REP_Pos                  (0UL)                     /*!< REP (Bit 0)                                           */
#define ATIM_RCR_REP_Msk                  (0xffffUL)                /*!< REP (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CCR1  ========================================================== */
#define ATIM_CCR1_CCR1_Pos                (0UL)                     /*!< CCR1 (Bit 0)                                          */
#define ATIM_CCR1_CCR1_Msk                (0xffffUL)                /*!< CCR1 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR2  ========================================================== */
#define ATIM_CCR2_CCR2_Pos                (0UL)                     /*!< CCR2 (Bit 0)                                          */
#define ATIM_CCR2_CCR2_Msk                (0xffffUL)                /*!< CCR2 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR3  ========================================================== */
#define ATIM_CCR3_CCR3_Pos                (0UL)                     /*!< CCR3 (Bit 0)                                          */
#define ATIM_CCR3_CCR3_Msk                (0xffffUL)                /*!< CCR3 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR4  ========================================================== */
#define ATIM_CCR4_CCR4_Pos                (0UL)                     /*!< CCR4 (Bit 0)                                          */
#define ATIM_CCR4_CCR4_Msk                (0xffffUL)                /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR5  ========================================================== */
