hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
#define ATIM_CCR5_GC5C6_Pos               (31UL)                    /*!< GC5C6 (Bit 31)                                        */
#define ATIM_CCR5_GC5C6_Msk               (0x80000000UL)            /*!< GC5C6 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C5_Pos               (30UL)                    /*!< GC5C5 (Bit 30)                                        */
#define ATIM_CCR5_GC5C5_Msk               (0x40000000UL)            /*!< GC5C5 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C4_Pos               (29UL)                    /*!< GC5C4 (Bit 29)                                        */
#define ATIM_CCR5_GC5C4_Msk               (0x20000000UL)            /*!< GC5C4 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C3_Pos               (28UL)                    /*!< GC5C3 (Bit 28)                                        */
#define ATIM_CCR5_GC5C3_Msk               (0x10000000UL)            /*!< GC5C3 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C2_Pos               (27UL)                    /*!< GC5C2 (Bit 27)                                        */
#define ATIM_CCR5_GC5C2_Msk               (0x8000000UL)             /*!< GC5C2 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_GC5C1_Pos               (26UL)                    /*!< GC5C1 (Bit 26)                                        */
#define ATIM_CCR5_GC5C1_Msk               (0x4000000UL)             /*!< GC5C1 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR5_CCR5_Pos                (0UL)                     /*!< CCR5 (Bit 0)                                          */
#define ATIM_CCR5_CCR5_Msk                (0xffffUL)                /*!< CCR5 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR6  ========================================================== */
#define ATIM_CCR6_GC6C6_Pos               (31UL)                    /*!< GC6C6 (Bit 31)                                        */
#define ATIM_CCR6_GC6C6_Msk               (0x80000000UL)            /*!< GC6C6 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C5_Pos               (30UL)                    /*!< GC6C5 (Bit 30)                                        */
#define ATIM_CCR6_GC6C5_Msk               (0x40000000UL)            /*!< GC6C5 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C4_Pos               (29UL)                    /*!< GC6C4 (Bit 29)                                        */
#define ATIM_CCR6_GC6C4_Msk               (0x20000000UL)            /*!< GC6C4 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C3_Pos               (28UL)                    /*!< GC6C3 (Bit 28)                                        */
#define ATIM_CCR6_GC6C3_Msk               (0x10000000UL)            /*!< GC6C3 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C2_Pos               (27UL)                    /*!< GC6C2 (Bit 27)                                        */
#define ATIM_CCR6_GC6C2_Msk               (0x8000000UL)             /*!< GC6C2 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_GC6C1_Pos               (26UL)                    /*!< GC6C1 (Bit 26)                                        */
#define ATIM_CCR6_GC6C1_Msk               (0x4000000UL)             /*!< GC6C1 (Bitfield-Mask: 0x01)                           */
#define ATIM_CCR6_CCR6_Pos                (0UL)                     /*!< CCR6 (Bit 0)                                          */
#define ATIM_CCR6_CCR6_Msk                (0xffffUL)                /*!< CCR6 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  BDTR  ========================================================== */
#define ATIM_BDTR_BK2P_Pos                (25UL)                    /*!< BK2P (Bit 25)                                         */
#define ATIM_BDTR_BK2P_Msk                (0x2000000UL)             /*!< BK2P (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_BK2E_Pos                (24UL)                    /*!< BK2E (Bit 24)                                         */
#define ATIM_BDTR_BK2E_Msk                (0x1000000UL)             /*!< BK2E (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_BK2F_Pos                (20UL)                    /*!< BK2F (Bit 20)                                         */
#define ATIM_BDTR_BK2F_Msk                (0xf00000UL)              /*!< BK2F (Bitfield-Mask: 0x0f)                            */
#define ATIM_BDTR_BKF_Pos                 (16UL)                    /*!< BKF (Bit 16)                                          */
#define ATIM_BDTR_BKF_Msk                 (0xf0000UL)               /*!< BKF (Bitfield-Mask: 0x0f)                             */
#define ATIM_BDTR_MOE_Pos                 (15UL)                    /*!< MOE (Bit 15)                                          */
#define ATIM_BDTR_MOE_Msk                 (0x8000UL)                /*!< MOE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_AOE_Pos                 (14UL)                    /*!< AOE (Bit 14)                                          */
#define ATIM_BDTR_AOE_Msk                 (0x4000UL)                /*!< AOE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_BKP_Pos                 (13UL)                    /*!< BKP (Bit 13)                                          */
#define ATIM_BDTR_BKP_Msk                 (0x2000UL)                /*!< BKP (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_BKE_Pos                 (12UL)                    /*!< BKE (Bit 12)                                          */
#define ATIM_BDTR_BKE_Msk                 (0x1000UL)                /*!< BKE (Bitfield-Mask: 0x01)                             */
#define ATIM_BDTR_OSSR_Pos                (11UL)                    /*!< OSSR (Bit 11)                                         */
#define ATIM_BDTR_OSSR_Msk                (0x800UL)                 /*!< OSSR (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_OSSI_Pos                (10UL)                    /*!< OSSI (Bit 10)                                         */
#define ATIM_BDTR_OSSI_Msk                (0x400UL)                 /*!< OSSI (Bitfield-Mask: 0x01)                            */
#define ATIM_BDTR_LOCK_Pos                (8UL)                     /*!< LOCK (Bit 8)                                          */
#define ATIM_BDTR_LOCK_Msk                (0x300UL)                 /*!< LOCK (Bitfield-Mask: 0x03)                            */
#define ATIM_BDTR_DTG_Pos                 (0UL)                     /*!< DTG (Bit 0)                                           */
#define ATIM_BDTR_DTG_Msk                 (0xffUL)                  /*!< DTG (Bitfield-Mask: 0xff)                             */
/* =========================================================  DTR2  ========================================================== */
#define ATIM_DTR2_DTPE_Pos                (17UL)                    /*!< DTPE (Bit 17)                                         */
#define ATIM_DTR2_DTPE_Msk                (0x20000UL)               /*!< DTPE (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR2_DTAE_Pos                (16UL)                    /*!< DTAE (Bit 16)                                         */
#define ATIM_DTR2_DTAE_Msk                (0x10000UL)               /*!< DTAE (Bitfield-Mask: 0x01)                            */
#define ATIM_DTR2_DTGF_Pos                (0UL)                     /*!< DTGF (Bit 0)                                          */
#define ATIM_DTR2_DTGF_Msk                (0xffUL)                  /*!< DTGF (Bitfield-Mask: 0xff)                            */
/* ==========================================================  ECR  ========================================================== */
#define ATIM_ECR_IPOS_Pos                 (6UL)                     /*!< IPOS (Bit 6)                                          */
#define ATIM_ECR_IPOS_Msk                 (0xc0UL)                  /*!< IPOS (Bitfield-Mask: 0x03)                            */
#define ATIM_ECR_FIDX_Pos                 (5UL)                     /*!< FIDX (Bit 5)                                          */
#define ATIM_ECR_FIDX_Msk                 (0x20UL)                  /*!< FIDX (Bitfield-Mask: 0x01)                            */
#define ATIM_ECR_IDIR_Pos                 (1UL)                     /*!< IDIR (Bit 1)                                          */
#define ATIM_ECR_IDIR_Msk                 (0x6UL)                   /*!< IDIR (Bitfield-Mask: 0x03)                            */
#define ATIM_ECR_IE_Pos                   (0UL)                     /*!< IE (Bit 0)                                            */
#define ATIM_ECR_IE_Msk                   (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* ========================================================  TISEL1  ========================================================= */
#define ATIM_TISEL1_TI4SEL_Pos            (24UL)                    /*!< TI4SEL (Bit 24)                                       */
#define ATIM_TISEL1_TI4SEL_Msk            (0xf000000UL)             /*!< TI4SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI3SEL_Pos            (16UL)                    /*!< TI3SEL (Bit 16)                                       */
#define ATIM_TISEL1_TI3SEL_Msk            (0xf0000UL)               /*!< TI3SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI2SEL_Pos            (8UL)                     /*!< TI2SEL (Bit 8)                                        */
#define ATIM_TISEL1_TI2SEL_Msk            (0xf00UL)                 /*!< TI2SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL1_TI1SEL_Pos            (0UL)                     /*!< TI1SEL (Bit 0)                                        */
#define ATIM_TISEL1_TI1SEL_Msk            (0xfUL)                   /*!< TI1SEL (Bitfield-Mask: 0x0f)                          */
/* ========================================================  TISEL2  ========================================================= */
#define ATIM_TISEL2_TI6SEL_Pos            (8UL)                     /*!< TI6SEL (Bit 8)                                        */
#define ATIM_TISEL2_TI6SEL_Msk            (0xf00UL)                 /*!< TI6SEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_TISEL2_TI5SEL_Pos            (0UL)                     /*!< TI5SEL (Bit 0)                                        */
#define ATIM_TISEL2_TI5SEL_Msk            (0xfUL)                   /*!< TI5SEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF1  ========================================================== */
#define ATIM_AF1_ETRSEL_Pos               (14UL)                    /*!< ETRSEL (Bit 14)                                       */
#define ATIM_AF1_ETRSEL_Msk               (0x3c000UL)               /*!< ETRSEL (Bitfield-Mask: 0x0f)                          */
#define ATIM_AF1_BKVC2P_Pos               (11UL)                    /*!< BKVC2P (Bit 11)                                       */
#define ATIM_AF1_BKVC2P_Msk               (0x800UL)                 /*!< BKVC2P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC1P_Pos               (10UL)                    /*!< BKVC1P (Bit 10)                                       */
#define ATIM_AF1_BKVC1P_Msk               (0x400UL)                 /*!< BKVC1P (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKINP_Pos                (9UL)                     /*!< BKINP (Bit 9)                                         */
#define ATIM_AF1_BKINP_Msk                (0x200UL)                 /*!< BKINP (Bitfield-Mask: 0x01)                           */
#define ATIM_AF1_BKVC2E_Pos               (2UL)                     /*!< BKVC2E (Bit 2)                                        */
#define ATIM_AF1_BKVC2E_Msk               (0x4UL)                   /*!< BKVC2E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKVC1E_Pos               (1UL)                     /*!< BKVC1E (Bit 1)                                        */
#define ATIM_AF1_BKVC1E_Msk               (0x2UL)                   /*!< BKVC1E (Bitfield-Mask: 0x01)                          */
#define ATIM_AF1_BKINE_Pos                (0UL)                     /*!< BKINE (Bit 0)                                         */
#define ATIM_AF1_BKINE_Msk                (0x1UL)                   /*!< BKINE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  AF2  ========================================================== */
#define ATIM_AF2_OCRSEL_Pos               (16UL)                    /*!< OCRSEL (Bit 16)                                       */
#define ATIM_AF2_OCRSEL_Msk               (0x70000UL)               /*!< OCRSEL (Bitfield-Mask: 0x07)                          */
#define ATIM_AF2_BK2VC2P_Pos              (11UL)                    /*!< BK2VC2P (Bit 11)                                      */
#define ATIM_AF2_BK2VC2P_Msk              (0x800UL)                 /*!< BK2VC2P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC1P_Pos              (10UL)                    /*!< BK2VC1P (Bit 10)                                      */
#define ATIM_AF2_BK2VC1P_Msk              (0x400UL)                 /*!< BK2VC1P (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2INP_Pos               (9UL)                     /*!< BK2INP (Bit 9)                                        */
#define ATIM_AF2_BK2INP_Msk               (0x200UL)                 /*!< BK2INP (Bitfield-Mask: 0x01)                          */
#define ATIM_AF2_BK2VC2E_Pos              (2UL)                     /*!< BK2VC2E (Bit 2)                                       */
#define ATIM_AF2_BK2VC2E_Msk              (0x4UL)                   /*!< BK2VC2E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2VC1E_Pos              (1UL)                     /*!< BK2VC1E (Bit 1)                                       */
#define ATIM_AF2_BK2VC1E_Msk              (0x2UL)                   /*!< BK2VC1E (Bitfield-Mask: 0x01)                         */
#define ATIM_AF2_BK2INE_Pos               (0UL)                     /*!< BK2INE (Bit 0)                                        */
#define ATIM_AF2_BK2INE_Msk               (0x1UL)                   /*!< BK2INE (Bitfield-Mask: 0x01)                          */
/* ==========================================================  ICR  ========================================================== */
#define ATIM_ICR_TERRF_Pos                (23UL)                    /*!< TERRF (Bit 23)                                        */
#define ATIM_ICR_TERRF_Msk                (0x800000UL)              /*!< TERRF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_IERRF_Pos                (22UL)                    /*!< IERRF (Bit 22)                                        */
#define ATIM_ICR_IERRF_Msk                (0x400000UL)              /*!< IERRF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_DIRF_Pos                 (21UL)                    /*!< DIRF (Bit 21)                                         */
#define ATIM_ICR_DIRF_Msk                 (0x200000UL)              /*!< DIRF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_IDXF_Pos                 (20UL)                    /*!< IDXF (Bit 20)                                         */
#define ATIM_ICR_IDXF_Msk                 (0x100000UL)              /*!< IDXF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_CC6OF_Pos                (19UL)                    /*!< CC6OF (Bit 19)                                        */
#define ATIM_ICR_CC6OF_Msk                (0x80000UL)               /*!< CC6OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC5OF_Pos                (18UL)                    /*!< CC5OF (Bit 18)                                        */
#define ATIM_ICR_CC5OF_Msk                (0x40000UL)               /*!< CC5OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC6IF_Pos                (17UL)                    /*!< CC6IF (Bit 17)                                        */
#define ATIM_ICR_CC6IF_Msk                (0x20000UL)               /*!< CC6IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC5IF_Pos                (16UL)                    /*!< CC5IF (Bit 16)                                        */
#define ATIM_ICR_CC5IF_Msk                (0x10000UL)               /*!< CC5IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_SBIF_Pos                 (13UL)                    /*!< SBIF (Bit 13)                                         */
#define ATIM_ICR_SBIF_Msk                 (0x2000UL)                /*!< SBIF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_CC4OF_Pos                (12UL)                    /*!< CC4OF (Bit 12)                                        */
#define ATIM_ICR_CC4OF_Msk                (0x1000UL)                /*!< CC4OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC3OF_Pos                (11UL)                    /*!< CC3OF (Bit 11)                                        */
#define ATIM_ICR_CC3OF_Msk                (0x800UL)                 /*!< CC3OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC2OF_Pos                (10UL)                    /*!< CC2OF (Bit 10)                                        */
#define ATIM_ICR_CC2OF_Msk                (0x400UL)                 /*!< CC2OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC1OF_Pos                (9UL)                     /*!< CC1OF (Bit 9)                                         */
#define ATIM_ICR_CC1OF_Msk                (0x200UL)                 /*!< CC1OF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_B2IF_Pos                 (8UL)                     /*!< B2IF (Bit 8)                                          */
#define ATIM_ICR_B2IF_Msk                 (0x100UL)                 /*!< B2IF (Bitfield-Mask: 0x01)                            */
#define ATIM_ICR_BIF_Pos                  (7UL)                     /*!< BIF (Bit 7)                                           */
#define ATIM_ICR_BIF_Msk                  (0x80UL)                  /*!< BIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_TIF_Pos                  (6UL)                     /*!< TIF (Bit 6)                                           */
#define ATIM_ICR_TIF_Msk                  (0x40UL)                  /*!< TIF (Bitfield-Mask: 0x01)                             */
#define ATIM_ICR_COMIF_Pos                (5UL)                     /*!< COMIF (Bit 5)                                         */
#define ATIM_ICR_COMIF_Msk                (0x20UL)                  /*!< COMIF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC4IF_Pos                (4UL)                     /*!< CC4IF (Bit 4)                                         */
#define ATIM_ICR_CC4IF_Msk                (0x10UL)                  /*!< CC4IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC3IF_Pos                (3UL)                     /*!< CC3IF (Bit 3)                                         */
#define ATIM_ICR_CC3IF_Msk                (0x8UL)                   /*!< CC3IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC2IF_Pos                (2UL)                     /*!< CC2IF (Bit 2)                                         */
#define ATIM_ICR_CC2IF_Msk                (0x4UL)                   /*!< CC2IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_CC1IF_Pos                (1UL)                     /*!< CC1IF (Bit 1)                                         */
#define ATIM_ICR_CC1IF_Msk                (0x2UL)                   /*!< CC1IF (Bitfield-Mask: 0x01)                           */
#define ATIM_ICR_UIF_Pos                  (0UL)                     /*!< UIF (Bit 0)                                           */
#define ATIM_ICR_UIF_Msk                  (0x1UL)                   /*!< UIF (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                           BTIM                                            ================ */
/* =========================================================================================================================== */

