hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
#define GTIMx_CCMR2CAP_IC4PSC_Pos         (10UL)                    /*!< IC4PSC (Bit 10)                                       */
#define GTIMx_CCMR2CAP_IC4PSC_Msk         (0xc00UL)                 /*!< IC4PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR2CAP_CC4S_Pos           (8UL)                     /*!< CC4S (Bit 8)                                          */
#define GTIMx_CCMR2CAP_CC4S_Msk           (0x300UL)                 /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR2CAP_IC3F_Pos           (4UL)                     /*!< IC3F (Bit 4)                                          */
#define GTIMx_CCMR2CAP_IC3F_Msk           (0xf0UL)                  /*!< IC3F (Bitfield-Mask: 0x0f)                            */
#define GTIMx_CCMR2CAP_IC3PSC_Pos         (2UL)                     /*!< IC3PSC (Bit 2)                                        */
#define GTIMx_CCMR2CAP_IC3PSC_Msk         (0xcUL)                   /*!< IC3PSC (Bitfield-Mask: 0x03)                          */
#define GTIMx_CCMR2CAP_CC3S_Pos           (0UL)                     /*!< CC3S (Bit 0)                                          */
#define GTIMx_CCMR2CAP_CC3S_Msk           (0x3UL)                   /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =======================================================  CCMR2CMP  ======================================================== */
#define GTIMx_CCMR2CMP_OC4MH_Pos          (24UL)                    /*!< OC4MH (Bit 24)                                        */
#define GTIMx_CCMR2CMP_OC4MH_Msk          (0x1000000UL)             /*!< OC4MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3MH_Pos          (16UL)                    /*!< OC3MH (Bit 16)                                        */
#define GTIMx_CCMR2CMP_OC3MH_Msk          (0x10000UL)               /*!< OC3MH (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4CE_Pos          (15UL)                    /*!< OC4CE (Bit 15)                                        */
#define GTIMx_CCMR2CMP_OC4CE_Msk          (0x8000UL)                /*!< OC4CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4M_Pos           (12UL)                    /*!< OC4M (Bit 12)                                         */
#define GTIMx_CCMR2CMP_OC4M_Msk           (0x7000UL)                /*!< OC4M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR2CMP_OC4PE_Pos          (11UL)                    /*!< OC4PE (Bit 11)                                        */
#define GTIMx_CCMR2CMP_OC4PE_Msk          (0x800UL)                 /*!< OC4PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC4FE_Pos          (10UL)                    /*!< OC4FE (Bit 10)                                        */
#define GTIMx_CCMR2CMP_OC4FE_Msk          (0x400UL)                 /*!< OC4FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_CC4S_Pos           (8UL)                     /*!< CC4S (Bit 8)                                          */
#define GTIMx_CCMR2CMP_CC4S_Msk           (0x300UL)                 /*!< CC4S (Bitfield-Mask: 0x03)                            */
#define GTIMx_CCMR2CMP_OC3CE_Pos          (7UL)                     /*!< OC3CE (Bit 7)                                         */
#define GTIMx_CCMR2CMP_OC3CE_Msk          (0x80UL)                  /*!< OC3CE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3M_Pos           (4UL)                     /*!< OC3M (Bit 4)                                          */
#define GTIMx_CCMR2CMP_OC3M_Msk           (0x70UL)                  /*!< OC3M (Bitfield-Mask: 0x07)                            */
#define GTIMx_CCMR2CMP_OC3PE_Pos          (3UL)                     /*!< OC3PE (Bit 3)                                         */
#define GTIMx_CCMR2CMP_OC3PE_Msk          (0x8UL)                   /*!< OC3PE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_OC3FE_Pos          (2UL)                     /*!< OC3FE (Bit 2)                                         */
#define GTIMx_CCMR2CMP_OC3FE_Msk          (0x4UL)                   /*!< OC3FE (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCMR2CMP_CC3S_Pos           (0UL)                     /*!< CC3S (Bit 0)                                          */
#define GTIMx_CCMR2CMP_CC3S_Msk           (0x3UL)                   /*!< CC3S (Bitfield-Mask: 0x03)                            */
/* =========================================================  CCER  ========================================================== */
#define GTIMx_CCER_CC4NP_Pos              (15UL)                    /*!< CC4NP (Bit 15)                                        */
#define GTIMx_CCER_CC4NP_Msk              (0x8000UL)                /*!< CC4NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC4P_Pos               (13UL)                    /*!< CC4P (Bit 13)                                         */
#define GTIMx_CCER_CC4P_Msk               (0x2000UL)                /*!< CC4P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC4E_Pos               (12UL)                    /*!< CC4E (Bit 12)                                         */
#define GTIMx_CCER_CC4E_Msk               (0x1000UL)                /*!< CC4E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC3NP_Pos              (11UL)                    /*!< CC3NP (Bit 11)                                        */
#define GTIMx_CCER_CC3NP_Msk              (0x800UL)                 /*!< CC3NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC3P_Pos               (9UL)                     /*!< CC3P (Bit 9)                                          */
#define GTIMx_CCER_CC3P_Msk               (0x200UL)                 /*!< CC3P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC3E_Pos               (8UL)                     /*!< CC3E (Bit 8)                                          */
#define GTIMx_CCER_CC3E_Msk               (0x100UL)                 /*!< CC3E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC2NP_Pos              (7UL)                     /*!< CC2NP (Bit 7)                                         */
#define GTIMx_CCER_CC2NP_Msk              (0x80UL)                  /*!< CC2NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC2P_Pos               (5UL)                     /*!< CC2P (Bit 5)                                          */
#define GTIMx_CCER_CC2P_Msk               (0x20UL)                  /*!< CC2P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC2E_Pos               (4UL)                     /*!< CC2E (Bit 4)                                          */
#define GTIMx_CCER_CC2E_Msk               (0x10UL)                  /*!< CC2E (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC1NP_Pos              (3UL)                     /*!< CC1NP (Bit 3)                                         */
#define GTIMx_CCER_CC1NP_Msk              (0x8UL)                   /*!< CC1NP (Bitfield-Mask: 0x01)                           */
#define GTIMx_CCER_CC1P_Pos               (1UL)                     /*!< CC1P (Bit 1)                                          */
#define GTIMx_CCER_CC1P_Msk               (0x2UL)                   /*!< CC1P (Bitfield-Mask: 0x01)                            */
#define GTIMx_CCER_CC1E_Pos               (0UL)                     /*!< CC1E (Bit 0)                                          */
#define GTIMx_CCER_CC1E_Msk               (0x1UL)                   /*!< CC1E (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CNT  ========================================================== */
#define GTIMx_CNT_UIFCPY_Pos              (31UL)                    /*!< UIFCPY (Bit 31)                                       */
#define GTIMx_CNT_UIFCPY_Msk              (0x80000000UL)            /*!< UIFCPY (Bitfield-Mask: 0x01)                          */
#define GTIMx_CNT_CNT_Pos                 (0UL)                     /*!< CNT (Bit 0)                                           */
#define GTIMx_CNT_CNT_Msk                 (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  PSC  ========================================================== */
#define GTIMx_PSC_PSC_Pos                 (0UL)                     /*!< PSC (Bit 0)                                           */
#define GTIMx_PSC_PSC_Msk                 (0xffffUL)                /*!< PSC (Bitfield-Mask: 0xffff)                           */
/* ==========================================================  ARR  ========================================================== */
#define GTIMx_ARR_ARR_Pos                 (0UL)                     /*!< ARR (Bit 0)                                           */
#define GTIMx_ARR_ARR_Msk                 (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* =========================================================  CCR1  ========================================================== */
#define GTIMx_CCR1_CCR1_Pos               (0UL)                     /*!< CCR1 (Bit 0)                                          */
#define GTIMx_CCR1_CCR1_Msk               (0xffffUL)                /*!< CCR1 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR2  ========================================================== */
#define GTIMx_CCR2_CCR2_Pos               (0UL)                     /*!< CCR2 (Bit 0)                                          */
#define GTIMx_CCR2_CCR2_Msk               (0xffffUL)                /*!< CCR2 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR3  ========================================================== */
#define GTIMx_CCR3_CCR3_Pos               (0UL)                     /*!< CCR3 (Bit 0)                                          */
#define GTIMx_CCR3_CCR3_Msk               (0xffffUL)                /*!< CCR3 (Bitfield-Mask: 0xffff)                          */
/* =========================================================  CCR4  ========================================================== */
#define GTIMx_CCR4_CCR4_Pos               (0UL)                     /*!< CCR4 (Bit 0)                                          */
#define GTIMx_CCR4_CCR4_Msk               (0xffffUL)                /*!< CCR4 (Bitfield-Mask: 0xffff)                          */
/* ==========================================================  ECR  ========================================================== */
#define GTIMx_ECR_IPOS_Pos                (6UL)                     /*!< IPOS (Bit 6)                                          */
#define GTIMx_ECR_IPOS_Msk                (0xc0UL)                  /*!< IPOS (Bitfield-Mask: 0x03)                            */
#define GTIMx_ECR_FIDX_Pos                (5UL)                     /*!< FIDX (Bit 5)                                          */
#define GTIMx_ECR_FIDX_Msk                (0x20UL)                  /*!< FIDX (Bitfield-Mask: 0x01)                            */
#define GTIMx_ECR_IDIR_Pos                (1UL)                     /*!< IDIR (Bit 1)                                          */
#define GTIMx_ECR_IDIR_Msk                (0x6UL)                   /*!< IDIR (Bitfield-Mask: 0x03)                            */
#define GTIMx_ECR_IE_Pos                  (0UL)                     /*!< IE (Bit 0)                                            */
#define GTIMx_ECR_IE_Msk                  (0x1UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
/* =========================================================  TISEL  ========================================================= */
#define GTIMx_TISEL_TI4SEL_Pos            (24UL)                    /*!< TI4SEL (Bit 24)                                       */
#define GTIMx_TISEL_TI4SEL_Msk            (0xf000000UL)             /*!< TI4SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI3SEL_Pos            (16UL)                    /*!< TI3SEL (Bit 16)                                       */
#define GTIMx_TISEL_TI3SEL_Msk            (0xf0000UL)               /*!< TI3SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI2SEL_Pos            (8UL)                     /*!< TI2SEL (Bit 8)                                        */
#define GTIMx_TISEL_TI2SEL_Msk            (0xf00UL)                 /*!< TI2SEL (Bitfield-Mask: 0x0f)                          */
#define GTIMx_TISEL_TI1SEL_Pos            (0UL)                     /*!< TI1SEL (Bit 0)                                        */
#define GTIMx_TISEL_TI1SEL_Msk            (0xfUL)                   /*!< TI1SEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF1  ========================================================== */
#define GTIMx_AF1_ETRSEL_Pos              (14UL)                    /*!< ETRSEL (Bit 14)                                       */
#define GTIMx_AF1_ETRSEL_Msk              (0x3c000UL)               /*!< ETRSEL (Bitfield-Mask: 0x0f)                          */
/* ==========================================================  AF2  ========================================================== */
#define GTIMx_AF2_OCRSEL_Pos              (16UL)                    /*!< OCRSEL (Bit 16)                                       */
#define GTIMx_AF2_OCRSEL_Msk              (0x70000UL)               /*!< OCRSEL (Bitfield-Mask: 0x07)                          */


/* =========================================================================================================================== */
/* ================                                            I2C                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  BRREN  ========================================================= */
#define I2Cx_BRREN_EN_Pos                 (0UL)                     /*!< EN (Bit 0)                                            */
#define I2Cx_BRREN_EN_Msk                 (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  BRR  ========================================================== */
#define I2Cx_BRR_BRR_Pos                  (0UL)                     /*!< BRR (Bit 0)                                           */
#define I2Cx_BRR_BRR_Msk                  (0xffUL)                  /*!< BRR (Bitfield-Mask: 0xff)                             */
/* ==========================================================  CR  =========================================================== */
#define I2Cx_CR_SDAINSRC_Pos              (11UL)                    /*!< SDAINSRC (Bit 11)                                     */
#define I2Cx_CR_SDAINSRC_Msk              (0x3800UL)                /*!< SDAINSRC (Bitfield-Mask: 0x07)                        */
#define I2Cx_CR_SCLINSRC_Pos              (8UL)                     /*!< SCLINSRC (Bit 8)                                      */
#define I2Cx_CR_SCLINSRC_Msk              (0x700UL)                 /*!< SCLINSRC (Bitfield-Mask: 0x07)                        */
#define I2Cx_CR_EN_Pos                    (6UL)                     /*!< EN (Bit 6)                                            */
#define I2Cx_CR_EN_Msk                    (0x40UL)                  /*!< EN (Bitfield-Mask: 0x01)                              */
#define I2Cx_CR_STA_Pos                   (5UL)                     /*!< STA (Bit 5)                                           */
#define I2Cx_CR_STA_Msk                   (0x20UL)                  /*!< STA (Bitfield-Mask: 0x01)                             */
#define I2Cx_CR_STO_Pos                   (4UL)                     /*!< STO (Bit 4)                                           */
#define I2Cx_CR_STO_Msk                   (0x10UL)                  /*!< STO (Bitfield-Mask: 0x01)                             */
#define I2Cx_CR_SI_Pos                    (3UL)                     /*!< SI (Bit 3)                                            */
#define I2Cx_CR_SI_Msk                    (0x8UL)                   /*!< SI (Bitfield-Mask: 0x01)                              */
#define I2Cx_CR_AA_Pos                    (2UL)                     /*!< AA (Bit 2)                                            */
#define I2Cx_CR_AA_Msk                    (0x4UL)                   /*!< AA (Bitfield-Mask: 0x01)                              */
#define I2Cx_CR_FLT_Pos                   (0UL)                     /*!< FLT (Bit 0)                                           */
#define I2Cx_CR_FLT_Msk                   (0x1UL)                   /*!< FLT (Bitfield-Mask: 0x01)                             */
/* ==========================================================  DR  =========================================================== */
#define I2Cx_DR_DR_Pos                    (0UL)                     /*!< DR (Bit 0)                                            */
#define I2Cx_DR_DR_Msk                    (0xffUL)                  /*!< DR (Bitfield-Mask: 0xff)                              */
/* =========================================================  ADDR0  ========================================================= */
#define I2Cx_ADDR0_ADDR0_Pos              (1UL)                     /*!< ADDR0 (Bit 1)                                         */
#define I2Cx_ADDR0_ADDR0_Msk              (0xfeUL)                  /*!< ADDR0 (Bitfield-Mask: 0x7f)                           */
#define I2Cx_ADDR0_GC_Pos                 (0UL)                     /*!< GC (Bit 0)                                            */
#define I2Cx_ADDR0_GC_Msk                 (0x1UL)                   /*!< GC (Bitfield-Mask: 0x01)                              */
/* =========================================================  STAT  ========================================================== */
#define I2Cx_STAT_STAT_Pos                (0UL)                     /*!< STAT (Bit 0)                                          */
#define I2Cx_STAT_STAT_Msk                (0xffUL)                  /*!< STAT (Bitfield-Mask: 0xff)                            */
/* =========================================================  ADDR1  ========================================================= */
#define I2Cx_ADDR1_ADDR1_Pos              (1UL)                     /*!< ADDR1 (Bit 1)                                         */
#define I2Cx_ADDR1_ADDR1_Msk              (0xfeUL)                  /*!< ADDR1 (Bitfield-Mask: 0x7f)                           */
/* =========================================================  ADDR2  ========================================================= */
#define I2Cx_ADDR2_ADDR2_Pos              (1UL)                     /*!< ADDR2 (Bit 1)                                         */
#define I2Cx_ADDR2_ADDR2_Msk              (0xfeUL)                  /*!< ADDR2 (Bitfield-Mask: 0x7f)                           */
/* =========================================================  MATCH  ========================================================= */
#define I2Cx_MATCH_ADDR2_Pos              (2UL)                     /*!< ADDR2 (Bit 2)                                         */
#define I2Cx_MATCH_ADDR2_Msk              (0x4UL)                   /*!< ADDR2 (Bitfield-Mask: 0x01)                           */
#define I2Cx_MATCH_ADDR1_Pos              (1UL)                     /*!< ADDR1 (Bit 1)                                         */
#define I2Cx_MATCH_ADDR1_Msk              (0x2UL)                   /*!< ADDR1 (Bitfield-Mask: 0x01)                           */
#define I2Cx_MATCH_ADDR0_Pos              (0UL)                     /*!< ADDR0 (Bit 0)                                         */
#define I2Cx_MATCH_ADDR0_Msk              (0x1UL)                   /*!< ADDR0 (Bitfield-Mask: 0x01)                           */


/* =========================================================================================================================== */
/* ================                                           IRMOD                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define IRMOD_CR_INV_Pos                  (5UL)                     /*!< INV (Bit 5)                                           */
#define IRMOD_CR_INV_Msk                  (0x20UL)                  /*!< INV (Bitfield-Mask: 0x01)                             */
#define IRMOD_CR_IRSW_Pos                 (4UL)                     /*!< IRSW (Bit 4)                                          */
#define IRMOD_CR_IRSW_Msk                 (0x10UL)                  /*!< IRSW (Bitfield-Mask: 0x01)                            */
#define IRMOD_CR_MOD_Pos                  (0UL)                     /*!< MOD (Bit 0)                                           */
#define IRMOD_CR_MOD_Msk                  (0xfUL)                   /*!< MOD (Bitfield-Mask: 0x0f)                             */


/* =========================================================================================================================== */
/* ================                                           IWDT                                            ================ */
/* =========================================================================================================================== */

