hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
#define RTC_ICR_ALARMB_Pos                (1UL)                     /*!< ALARMB (Bit 1)                                        */
#define RTC_ICR_ALARMB_Msk                (0x2UL)                   /*!< ALARMB (Bitfield-Mask: 0x01)                          */
#define RTC_ICR_ALARMA_Pos                (0UL)                     /*!< ALARMA (Bit 0)                                        */
#define RTC_ICR_ALARMA_Msk                (0x1UL)                   /*!< ALARMA (Bitfield-Mask: 0x01)                          */
/* ========================================================  AWTARR  ========================================================= */
#define RTC_AWTARR_ARR_Pos                (0UL)                     /*!< ARR (Bit 0)                                           */
#define RTC_AWTARR_ARR_Msk                (0xffffUL)                /*!< ARR (Bitfield-Mask: 0xffff)                           */
/* ========================================================  AWTCNT  ========================================================= */
#define RTC_AWTCNT_CNT_Pos                (0UL)                     /*!< CNT (Bit 0)                                           */
#define RTC_AWTCNT_CNT_Msk                (0xffffUL)                /*!< CNT (Bitfield-Mask: 0xffff)                           */
/* =======================================================  COMPCFR1  ======================================================== */
#define RTC_COMPCFR1_EN_Pos               (15UL)                    /*!< EN (Bit 15)                                           */
#define RTC_COMPCFR1_EN_Msk               (0x8000UL)                /*!< EN (Bitfield-Mask: 0x01)                              */
#define RTC_COMPCFR1_SIGN_Pos             (14UL)                    /*!< SIGN (Bit 14)                                         */
#define RTC_COMPCFR1_SIGN_Msk             (0x4000UL)                /*!< SIGN (Bitfield-Mask: 0x01)                            */
#define RTC_COMPCFR1_PERIOD_Pos           (12UL)                    /*!< PERIOD (Bit 12)                                       */
#define RTC_COMPCFR1_PERIOD_Msk           (0x3000UL)                /*!< PERIOD (Bitfield-Mask: 0x03)                          */
#define RTC_COMPCFR1_COMP_Pos             (0UL)                     /*!< COMP (Bit 0)                                          */
#define RTC_COMPCFR1_COMP_Msk             (0xfffUL)                 /*!< COMP (Bitfield-Mask: 0xfff)                           */
/* =======================================================  COMPCFR2  ======================================================== */
#define RTC_COMPCFR2_PCLKCNT_Pos          (0UL)                     /*!< PCLKCNT (Bit 0)                                       */
#define RTC_COMPCFR2_PCLKCNT_Msk          (0x7ffUL)                 /*!< PCLKCNT (Bitfield-Mask: 0x7ff)                        */
/* =======================================================  COMPCFR3  ======================================================== */
#define RTC_COMPCFR3_PCLKCNT_Pos          (0UL)                     /*!< PCLKCNT (Bit 0)                                       */
#define RTC_COMPCFR3_PCLKCNT_Msk          (0x7ffUL)                 /*!< PCLKCNT (Bitfield-Mask: 0x7ff)                        */


/* =========================================================================================================================== */
/* ================                                            SPI                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR1  ========================================================== */
#define SPI_CR1_SMP_Pos                   (20UL)                    /*!< SMP (Bit 20)                                          */
#define SPI_CR1_SMP_Msk                   (0x100000UL)              /*!< SMP (Bitfield-Mask: 0x01)                             */
#define SPI_CR1_MISOHD_Pos                (19UL)                    /*!< MISOHD (Bit 19)                                       */
#define SPI_CR1_MISOHD_Msk                (0x80000UL)               /*!< MISOHD (Bitfield-Mask: 0x01)                          */
#define SPI_CR1_FLTEN_Pos                 (18UL)                    /*!< FLTEN (Bit 18)                                        */
#define SPI_CR1_FLTEN_Msk                 (0x40000UL)               /*!< FLTEN (Bitfield-Mask: 0x01)                           */
#define SPI_CR1_MODE_Pos                  (16UL)                    /*!< MODE (Bit 16)                                         */
#define SPI_CR1_MODE_Msk                  (0x30000UL)               /*!< MODE (Bitfield-Mask: 0x03)                            */
#define SPI_CR1_GAP_Pos                   (12UL)                    /*!< GAP (Bit 12)                                          */
#define SPI_CR1_GAP_Msk                   (0xf000UL)                /*!< GAP (Bitfield-Mask: 0x0f)                             */
#define SPI_CR1_WIDTH_Pos                 (8UL)                     /*!< WIDTH (Bit 8)                                         */
#define SPI_CR1_WIDTH_Msk                 (0xf00UL)                 /*!< WIDTH (Bitfield-Mask: 0x0f)                           */
#define SPI_CR1_LSBF_Pos                  (7UL)                     /*!< LSBF (Bit 7)                                          */
#define SPI_CR1_LSBF_Msk                  (0x80UL)                  /*!< LSBF (Bitfield-Mask: 0x01)                            */
#define SPI_CR1_BR_Pos                    (4UL)                     /*!< BR (Bit 4)                                            */
#define SPI_CR1_BR_Msk                    (0x70UL)                  /*!< BR (Bitfield-Mask: 0x07)                              */
#define SPI_CR1_CPOL_Pos                  (3UL)                     /*!< CPOL (Bit 3)                                          */
#define SPI_CR1_CPOL_Msk                  (0x8UL)                   /*!< CPOL (Bitfield-Mask: 0x01)                            */
#define SPI_CR1_CPHA_Pos                  (2UL)                     /*!< CPHA (Bit 2)                                          */
#define SPI_CR1_CPHA_Msk                  (0x4UL)                   /*!< CPHA (Bitfield-Mask: 0x01)                            */
#define SPI_CR1_SSM_Pos                   (1UL)                     /*!< SSM (Bit 1)                                           */
#define SPI_CR1_SSM_Msk                   (0x2UL)                   /*!< SSM (Bitfield-Mask: 0x01)                             */
#define SPI_CR1_MSTR_Pos                  (0UL)                     /*!< MSTR (Bit 0)                                          */
#define SPI_CR1_MSTR_Msk                  (0x1UL)                   /*!< MSTR (Bitfield-Mask: 0x01)                            */
/* ==========================================================  CR2  ========================================================== */
#define SPI_CR2_ADCTX_Pos                 (4UL)                     /*!< ADCTX (Bit 4)                                         */
#define SPI_CR2_ADCTX_Msk                 (0x10UL)                  /*!< ADCTX (Bitfield-Mask: 0x01)                           */
#define SPI_CR2_ADCRX_Pos                 (3UL)                     /*!< ADCRX (Bit 3)                                         */
#define SPI_CR2_ADCRX_Msk                 (0x8UL)                   /*!< ADCRX (Bitfield-Mask: 0x01)                           */
#define SPI_CR2_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define SPI_CR2_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR3  ========================================================== */
#define SPI_CR3_HDOE_Pos                  (0UL)                     /*!< HDOE (Bit 0)                                          */
#define SPI_CR3_HDOE_Msk                  (0x1UL)                   /*!< HDOE (Bitfield-Mask: 0x01)                            */
/* ==========================================================  SSI  ========================================================== */
#define SPI_SSI_SSI_Pos                   (0UL)                     /*!< SSI (Bit 0)                                           */
#define SPI_SSI_SSI_Msk                   (0x1UL)                   /*!< SSI (Bitfield-Mask: 0x01)                             */
/* ==========================================================  IER  ========================================================== */
#define SPI_IER_MODF_Pos                  (7UL)                     /*!< MODF (Bit 7)                                          */
#define SPI_IER_MODF_Msk                  (0x80UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPI_IER_SSERR_Pos                 (6UL)                     /*!< SSERR (Bit 6)                                         */
#define SPI_IER_SSERR_Msk                 (0x40UL)                  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPI_IER_OV_Pos                    (5UL)                     /*!< OV (Bit 5)                                            */
#define SPI_IER_OV_Msk                    (0x20UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPI_IER_UD_Pos                    (4UL)                     /*!< UD (Bit 4)                                            */
#define SPI_IER_UD_Msk                    (0x10UL)                  /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPI_IER_SSR_Pos                   (3UL)                     /*!< SSR (Bit 3)                                           */
#define SPI_IER_SSR_Msk                   (0x8UL)                   /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPI_IER_SSF_Pos                   (2UL)                     /*!< SSF (Bit 2)                                           */
#define SPI_IER_SSF_Msk                   (0x4UL)                   /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPI_IER_RXNE_Pos                  (1UL)                     /*!< RXNE (Bit 1)                                          */
#define SPI_IER_RXNE_Msk                  (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPI_IER_TXE_Pos                   (0UL)                     /*!< TXE (Bit 0)                                           */
#define SPI_IER_TXE_Msk                   (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ISR  ========================================================== */
#define SPI_ISR_SSLVL_Pos                 (9UL)                     /*!< SSLVL (Bit 9)                                         */
#define SPI_ISR_SSLVL_Msk                 (0x200UL)                 /*!< SSLVL (Bitfield-Mask: 0x01)                           */
#define SPI_ISR_BUSY_Pos                  (8UL)                     /*!< BUSY (Bit 8)                                          */
#define SPI_ISR_BUSY_Msk                  (0x100UL)                 /*!< BUSY (Bitfield-Mask: 0x01)                            */
#define SPI_ISR_MODF_Pos                  (7UL)                     /*!< MODF (Bit 7)                                          */
#define SPI_ISR_MODF_Msk                  (0x80UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPI_ISR_SSERR_Pos                 (6UL)                     /*!< SSERR (Bit 6)                                         */
#define SPI_ISR_SSERR_Msk                 (0x40UL)                  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPI_ISR_OV_Pos                    (5UL)                     /*!< OV (Bit 5)                                            */
#define SPI_ISR_OV_Msk                    (0x20UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPI_ISR_UD_Pos                    (4UL)                     /*!< UD (Bit 4)                                            */
#define SPI_ISR_UD_Msk                    (0x10UL)                  /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPI_ISR_SSR_Pos                   (3UL)                     /*!< SSR (Bit 3)                                           */
#define SPI_ISR_SSR_Msk                   (0x8UL)                   /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPI_ISR_SSF_Pos                   (2UL)                     /*!< SSF (Bit 2)                                           */
#define SPI_ISR_SSF_Msk                   (0x4UL)                   /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPI_ISR_RXNE_Pos                  (1UL)                     /*!< RXNE (Bit 1)                                          */
#define SPI_ISR_RXNE_Msk                  (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPI_ISR_TXE_Pos                   (0UL)                     /*!< TXE (Bit 0)                                           */
#define SPI_ISR_TXE_Msk                   (0x1UL)                   /*!< TXE (Bitfield-Mask: 0x01)                             */
/* ==========================================================  ICR  ========================================================== */
#define SPI_ICR_MODF_Pos                  (7UL)                     /*!< MODF (Bit 7)                                          */
#define SPI_ICR_MODF_Msk                  (0x80UL)                  /*!< MODF (Bitfield-Mask: 0x01)                            */
#define SPI_ICR_SSERR_Pos                 (6UL)                     /*!< SSERR (Bit 6)                                         */
#define SPI_ICR_SSERR_Msk                 (0x40UL)                  /*!< SSERR (Bitfield-Mask: 0x01)                           */
#define SPI_ICR_OV_Pos                    (5UL)                     /*!< OV (Bit 5)                                            */
#define SPI_ICR_OV_Msk                    (0x20UL)                  /*!< OV (Bitfield-Mask: 0x01)                              */
#define SPI_ICR_UD_Pos                    (4UL)                     /*!< UD (Bit 4)                                            */
#define SPI_ICR_UD_Msk                    (0x10UL)                  /*!< UD (Bitfield-Mask: 0x01)                              */
#define SPI_ICR_SSR_Pos                   (3UL)                     /*!< SSR (Bit 3)                                           */
#define SPI_ICR_SSR_Msk                   (0x8UL)                   /*!< SSR (Bitfield-Mask: 0x01)                             */
#define SPI_ICR_SSF_Pos                   (2UL)                     /*!< SSF (Bit 2)                                           */
#define SPI_ICR_SSF_Msk                   (0x4UL)                   /*!< SSF (Bitfield-Mask: 0x01)                             */
#define SPI_ICR_RXNE_Pos                  (1UL)                     /*!< RXNE (Bit 1)                                          */
#define SPI_ICR_RXNE_Msk                  (0x2UL)                   /*!< RXNE (Bitfield-Mask: 0x01)                            */
#define SPI_ICR_FLUSH_Pos                 (0UL)                     /*!< FLUSH (Bit 0)                                         */
#define SPI_ICR_FLUSH_Msk                 (0x1UL)                   /*!< FLUSH (Bitfield-Mask: 0x01)                           */
/* ==========================================================  DR  =========================================================== */
#define SPI_DR_DR_Pos                     (0UL)                     /*!< DR (Bit 0)                                            */
#define SPI_DR_DR_Msk                     (0xffffUL)                /*!< DR (Bitfield-Mask: 0xffff)                            */


/* =========================================================================================================================== */
/* ================                                          SYSCTRL                                          ================ */
/* =========================================================================================================================== */

