hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010.h
#define SYSCTRL_AHBEN_KEY_Pos             (16UL)                    /*!< KEY (Bit 16)                                          */
#define SYSCTRL_AHBEN_KEY_Msk             (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_AHBEN_GPIOB_Pos           (5UL)                     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBEN_GPIOB_Msk           (0x20UL)                  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_GPIOA_Pos           (4UL)                     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBEN_GPIOA_Msk           (0x10UL)                  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBEN_CRC_Pos             (2UL)                     /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBEN_CRC_Msk             (0x4UL)                   /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBEN_FLASH_Pos           (1UL)                     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBEN_FLASH_Msk           (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBEN2  ========================================================= */
#define SYSCTRL_APBEN2_KEY_Pos            (16UL)                    /*!< KEY (Bit 16)                                          */
#define SYSCTRL_APBEN2_KEY_Msk            (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_APBEN2_LPTIM_Pos          (7UL)                     /*!< LPTIM (Bit 7)                                         */
#define SYSCTRL_APBEN2_LPTIM_Msk          (0x80UL)                  /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN2_I2C1_Pos           (6UL)                     /*!< I2C1 (Bit 6)                                          */
#define SYSCTRL_APBEN2_I2C1_Msk           (0x40UL)                  /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_IWDT_Pos           (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_APBEN2_IWDT_Msk           (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN2_BTIM123_Pos        (2UL)                     /*!< BTIM123 (Bit 2)                                       */
#define SYSCTRL_APBEN2_BTIM123_Msk        (0x4UL)                   /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBEN2_RTC_Pos            (1UL)                     /*!< RTC (Bit 1)                                           */
#define SYSCTRL_APBEN2_RTC_Msk            (0x2UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBEN1  ========================================================= */
#define SYSCTRL_APBEN1_KEY_Pos            (16UL)                    /*!< KEY (Bit 16)                                          */
#define SYSCTRL_APBEN1_KEY_Msk            (0xffff0000UL)            /*!< KEY (Bitfield-Mask: 0xffff)                           */
#define SYSCTRL_APBEN1_GTIM1_Pos          (6UL)                     /*!< GTIM1 (Bit 6)                                         */
#define SYSCTRL_APBEN1_GTIM1_Msk          (0x40UL)                  /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_ATIM_Pos           (5UL)                     /*!< ATIM (Bit 5)                                          */
#define SYSCTRL_APBEN1_ATIM_Msk           (0x20UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_UART2_Pos          (4UL)                     /*!< UART2 (Bit 4)                                         */
#define SYSCTRL_APBEN1_UART2_Msk          (0x10UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_UART1_Pos          (3UL)                     /*!< UART1 (Bit 3)                                         */
#define SYSCTRL_APBEN1_UART1_Msk          (0x8UL)                   /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBEN1_SPI1_Pos           (2UL)                     /*!< SPI1 (Bit 2)                                          */
#define SYSCTRL_APBEN1_SPI1_Msk           (0x4UL)                   /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBEN1_VC_Pos             (1UL)                     /*!< VC (Bit 1)                                            */
#define SYSCTRL_APBEN1_VC_Msk             (0x2UL)                   /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBEN1_ADC_Pos            (0UL)                     /*!< ADC (Bit 0)                                           */
#define SYSCTRL_APBEN1_ADC_Msk            (0x1UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
/* ========================================================  AHBRST  ========================================================= */
#define SYSCTRL_AHBRST_GPIOB_Pos          (5UL)                     /*!< GPIOB (Bit 5)                                         */
#define SYSCTRL_AHBRST_GPIOB_Msk          (0x20UL)                  /*!< GPIOB (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_GPIOA_Pos          (4UL)                     /*!< GPIOA (Bit 4)                                         */
#define SYSCTRL_AHBRST_GPIOA_Msk          (0x10UL)                  /*!< GPIOA (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_AHBRST_CRC_Pos            (2UL)                     /*!< CRC (Bit 2)                                           */
#define SYSCTRL_AHBRST_CRC_Msk            (0x4UL)                   /*!< CRC (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_AHBRST_FLASH_Pos          (1UL)                     /*!< FLASH (Bit 1)                                         */
#define SYSCTRL_AHBRST_FLASH_Msk          (0x2UL)                   /*!< FLASH (Bitfield-Mask: 0x01)                           */
/* ========================================================  APBRST2  ======================================================== */
#define SYSCTRL_APBRST2_LPTIM_Pos         (7UL)                     /*!< LPTIM (Bit 7)                                         */
#define SYSCTRL_APBRST2_LPTIM_Msk         (0x80UL)                  /*!< LPTIM (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST2_I2C1_Pos          (6UL)                     /*!< I2C1 (Bit 6)                                          */
#define SYSCTRL_APBRST2_I2C1_Msk          (0x40UL)                  /*!< I2C1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_IWDT_Pos          (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_APBRST2_IWDT_Msk          (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST2_BTIM123_Pos       (2UL)                     /*!< BTIM123 (Bit 2)                                       */
#define SYSCTRL_APBRST2_BTIM123_Msk       (0x4UL)                   /*!< BTIM123 (Bitfield-Mask: 0x01)                         */
#define SYSCTRL_APBRST2_RTC_Pos           (1UL)                     /*!< RTC (Bit 1)                                           */
#define SYSCTRL_APBRST2_RTC_Msk           (0x2UL)                   /*!< RTC (Bitfield-Mask: 0x01)                             */
/* ========================================================  APBRST1  ======================================================== */
#define SYSCTRL_APBRST1_GTIM1_Pos         (6UL)                     /*!< GTIM1 (Bit 6)                                         */
#define SYSCTRL_APBRST1_GTIM1_Msk         (0x40UL)                  /*!< GTIM1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_ATIM_Pos          (5UL)                     /*!< ATIM (Bit 5)                                          */
#define SYSCTRL_APBRST1_ATIM_Msk          (0x20UL)                  /*!< ATIM (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_UART2_Pos         (4UL)                     /*!< UART2 (Bit 4)                                         */
#define SYSCTRL_APBRST1_UART2_Msk         (0x10UL)                  /*!< UART2 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_UART1_Pos         (3UL)                     /*!< UART1 (Bit 3)                                         */
#define SYSCTRL_APBRST1_UART1_Msk         (0x8UL)                   /*!< UART1 (Bitfield-Mask: 0x01)                           */
#define SYSCTRL_APBRST1_SPI1_Pos          (2UL)                     /*!< SPI1 (Bit 2)                                          */
#define SYSCTRL_APBRST1_SPI1_Msk          (0x4UL)                   /*!< SPI1 (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_APBRST1_VC_Pos            (1UL)                     /*!< VC (Bit 1)                                            */
#define SYSCTRL_APBRST1_VC_Msk            (0x2UL)                   /*!< VC (Bitfield-Mask: 0x01)                              */
#define SYSCTRL_APBRST1_ADC_Pos           (0UL)                     /*!< ADC (Bit 0)                                           */
#define SYSCTRL_APBRST1_ADC_Msk           (0x1UL)                   /*!< ADC (Bitfield-Mask: 0x01)                             */
/* =======================================================  RESETFLAG  ======================================================= */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Pos (9UL)                     /*!< SYSRESETREQ (Bit 9)                                   */
#define SYSCTRL_RESETFLAG_SYSRESETREQ_Msk (0x200UL)                 /*!< SYSRESETREQ (Bitfield-Mask: 0x01)                     */
#define SYSCTRL_RESETFLAG_LOCKUP_Pos      (8UL)                     /*!< LOCKUP (Bit 8)                                        */
#define SYSCTRL_RESETFLAG_LOCKUP_Msk      (0x100UL)                 /*!< LOCKUP (Bitfield-Mask: 0x01)                          */
#define SYSCTRL_RESETFLAG_RSTB_Pos        (6UL)                     /*!< RSTB (Bit 6)                                          */
#define SYSCTRL_RESETFLAG_RSTB_Msk        (0x40UL)                  /*!< RSTB (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_IWDT_Pos        (4UL)                     /*!< IWDT (Bit 4)                                          */
#define SYSCTRL_RESETFLAG_IWDT_Msk        (0x10UL)                  /*!< IWDT (Bitfield-Mask: 0x01)                            */
#define SYSCTRL_RESETFLAG_LVD_Pos         (3UL)                     /*!< LVD (Bit 3)                                           */
#define SYSCTRL_RESETFLAG_LVD_Msk         (0x8UL)                   /*!< LVD (Bitfield-Mask: 0x01)                             */
#define SYSCTRL_RESETFLAG_POR_Pos         (0UL)                     /*!< POR (Bit 0)                                           */
#define SYSCTRL_RESETFLAG_POR_Msk         (0x1UL)                   /*!< POR (Bitfield-Mask: 0x01)                             */
/* ==========================================================  MCO  ========================================================== */
#define SYSCTRL_MCO_DIV_Pos               (4UL)                     /*!< DIV (Bit 4)                                           */
#define SYSCTRL_MCO_DIV_Msk               (0x70UL)                  /*!< DIV (Bitfield-Mask: 0x07)                             */
#define SYSCTRL_MCO_SOURCE_Pos            (0UL)                     /*!< SOURCE (Bit 0)                                        */
#define SYSCTRL_MCO_SOURCE_Msk            (0xfUL)                   /*!< SOURCE (Bitfield-Mask: 0x0f)                          */


/* =========================================================================================================================== */
/* ================                                            VC                                             ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR0  ========================================================== */
#define VCx_CR0_INN_Pos                   (8UL)                     /*!< NCHANNEL (Bit 8)                                      */
#define VCx_CR0_INN_Msk                   (0x300UL)                 /*!< NCHANNEL (Bitfield-Mask: 0x03)                        */
#define VCx_CR0_INP_Pos                   (6UL)                     /*!< PCHANNEL (Bit 6)                                      */
#define VCx_CR0_INP_Msk                   (0xc0UL)                  /*!< PCHANNEL (Bitfield-Mask: 0x03)                        */
#define VCx_CR0_WINDOW_Pos                (5UL)                     /*!< WINDOW (Bit 5)                                        */
#define VCx_CR0_WINDOW_Msk                (0x20UL)                  /*!< WINDOW (Bitfield-Mask: 0x01)                          */
#define VCx_CR0_POL_Pos                   (4UL)                     /*!< POL (Bit 4)                                           */
#define VCx_CR0_POL_Msk                   (0x10UL)                  /*!< POL (Bitfield-Mask: 0x01)                             */
#define VCx_CR0_IE_Pos                    (3UL)                     /*!< IE (Bit 3)                                            */
#define VCx_CR0_IE_Msk                    (0x8UL)                   /*!< IE (Bitfield-Mask: 0x01)                              */
#define VCx_CR0_HYS_Pos                   (2UL)                     /*!< HYS (Bit 2)                                           */
#define VCx_CR0_HYS_Msk                   (0x4UL)                   /*!< HYS (Bitfield-Mask: 0x01)                             */
#define VCx_CR0_RESP_Pos                  (1UL)                     /*!< RESP (Bit 1)                                          */
#define VCx_CR0_RESP_Msk                  (0x2UL)                   /*!< RESP (Bitfield-Mask: 0x01)                            */
#define VCx_CR0_EN_Pos                    (0UL)                     /*!< EN (Bit 0)                                            */
#define VCx_CR0_EN_Msk                    (0x1UL)                   /*!< EN (Bitfield-Mask: 0x01)                              */
/* ==========================================================  CR1  ========================================================== */
#define VCx_CR1_BLANKLVL_Pos               (17UL)                    /*!< BLANKLVL (Bit 17)                                     */
#define VCx_CR1_BLANKLVL_Msk               (0x20000UL)               /*!< BLANKLVL (Bitfield-Mask: 0x01)                        */
#define VCx_CR1_BLANKTIME_Pos              (14UL)                    /*!< BLANKTIME (Bit 14)                                    */
#define VCx_CR1_BLANKTIME_Msk              (0x1c000UL)               /*!< BLANKTIME (Bitfield-Mask: 0x07)                       */
#define VCx_CR1_BLANKATCH6_Pos             (13UL)                    /*!< BLANKATCH6 (Bit 13)                                   */
#define VCx_CR1_BLANKATCH6_Msk             (0x2000UL)                /*!< BLANKATCH6 (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_BLANKATCH5_Pos             (12UL)                    /*!< BLANKATCH5 (Bit 12)                                   */
#define VCx_CR1_BLANKATCH5_Msk             (0x1000UL)                /*!< BLANKATCH5 (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_BLANKATCH4_Pos             (11UL)                    /*!< BLANKATCH4 (Bit 11)                                   */
#define VCx_CR1_BLANKATCH4_Msk             (0x800UL)                 /*!< BLANKATCH4 (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_BLANKATCH3_Pos             (10UL)                    /*!< BLANKATCH3 (Bit 10)                                   */
#define VCx_CR1_BLANKATCH3_Msk             (0x400UL)                 /*!< BLANKATCH3 (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_BLANKATCH2_Pos             (9UL)                     /*!< BLANKATCH2 (Bit 9)                                    */
#define VCx_CR1_BLANKATCH2_Msk             (0x200UL)                 /*!< BLANKATCH2 (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_BLANKATCH1_Pos             (8UL)                     /*!< BLANKATCH1 (Bit 8)                                    */
#define VCx_CR1_BLANKATCH1_Msk             (0x100UL)                 /*!< BLANKATCH1 (Bitfield-Mask: 0x01)                      */
#define VCx_CR1_HIGHIE_Pos                (7UL)                     /*!< HIGHIE (Bit 7)                                        */
#define VCx_CR1_HIGHIE_Msk                (0x80UL)                  /*!< HIGHIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_RISEIE_Pos                (6UL)                     /*!< RISEIE (Bit 6)                                        */
#define VCx_CR1_RISEIE_Msk                (0x40UL)                  /*!< RISEIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FALLIE_Pos                (5UL)                     /*!< FALLIE (Bit 5)                                        */
#define VCx_CR1_FALLIE_Msk                (0x20UL)                  /*!< FALLIE (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FLTCLK_Pos                (4UL)                     /*!< FLTCLK (Bit 4)                                        */
#define VCx_CR1_FLTCLK_Msk                (0x10UL)                  /*!< FLTCLK (Bitfield-Mask: 0x01)                          */
#define VCx_CR1_FLTTIME_Pos               (0UL)                     /*!< FLTTIME (Bit 0)                                       */
#define VCx_CR1_FLTTIME_Msk               (0xfUL)                   /*!< FLTTIME (Bitfield-Mask: 0x0f)                         */
/* ==========================================================  SR  =========================================================== */
#define VCx_SR_FLTV_Pos                   (1UL)                     /*!< FLTV (Bit 1)                                          */
#define VCx_SR_FLTV_Msk                   (0x2UL)                   /*!< FLTV (Bitfield-Mask: 0x01)                            */
#define VCx_SR_INTF_Pos                   (0UL)                     /*!< INTF (Bit 0)                                          */
#define VCx_SR_INTF_Msk                   (0x1UL)                   /*!< INTF (Bitfield-Mask: 0x01)                            */


/* =========================================================================================================================== */
/* ================                                           VCREF                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CR  =========================================================== */
#define VCREF_CR_VIN_Pos                  (5UL)                     /*!< VIN (Bit 5)                                           */
#define VCREF_CR_VIN_Msk                  (0x20UL)                  /*!< VIN (Bitfield-Mask: 0x01)                             */
#define VCREF_CR_EN_Pos                   (4UL)                     /*!< EN (Bit 4)                                            */
#define VCREF_CR_EN_Msk                   (0x10UL)                  /*!< EN (Bitfield-Mask: 0x01)                              */
#define VCREF_CR_DIV_Pos                  (0UL)                     /*!< DIV (Bit 0)                                           */
#define VCREF_CR_DIV_Msk                  (0x7UL)                   /*!< DIV (Bitfield-Mask: 0x07)                             */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* __CW32L010_H */


/** @} */ /* End of group CW32L010 */

/** @} */ /* End of group Wuhan Xinyuan Semiconductor Co.Ltd */
